["Do you want to watch something family friendly (yes/no)?", ["Do you want to watch something over 100 min (yes/no)?", ["Do you want to watch a movie that is over 15 years old (yes/no)?", [[{"Title": "Finding Nemo", "Year": "2003", "Rated": "G", "Runtime": "100", "Genre": "Animation, Adventure, Comedy", "Director": "Andrew Stanton", "Plot": "A clown fish named Marlin lives in the Great Barrier Reef and loses his son, Nemo, after he ventures into the open sea, despite his father's constant warnings about many of the ocean's dangers. Nemo is abducted by a boat and netted up and sent to a dentist's office in Sydney. While Marlin ventures off to try to retrieve Nemo, Marlin meets a fish named Dory, a blue tang suffering from short-term memory loss. The companions travel a great distance, encountering various dangerous sea creatures such as sharks, anglerfish and jellyfish, in order to rescue Nemo from the dentist's office, which is situated by Sydney Harbour. While the two are searching the ocean far and wide, Nemo and the other sea animals in the dentist's fish tank plot a way to return to the sea to live their lives free again.", "rottenTomatoes": "99%", "imdbRating": "8.2", "Metascore": "90", "BoxOffice": "$380,843,261", "imdbVotes": "1,041,093", "criticConsensus": "Breathtakingly lovely and grounded by the stellar efforts of a well-chosen cast, Finding Nemo adds another beautifully crafted gem to Pixar's crown.", "Rank": "4", "Poster": "https://m.media-amazon.com/images/M/MV5BZTAzNWZlNmUtZDEzYi00ZjA5LWIwYjEtZGM1NWE1MjE4YWRhXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SX300.jpg"}, {"Title": "The Incredibles", "Year": "2004", "Rated": "PG", "Runtime": "115", "Genre": "Animation, Action, Adventure", "Director": "Brad Bird", "Plot": "Bob Parr (A.K.A. Mr. Incredible), and his wife Helen (A.K.A. Elastigirl), are the world's greatest famous crime-fighting superheroes in Metroville. Always saving lives and battling evil on a daily basis. But fifteen years later, they have been forced to adopt civilian identities and retreat to the suburbs where they have no choice but to retire as superheroes to live a \"normal life\" with their three children Violet, Dash and Jack-Jack (who were secretly born with superpowers). Itching to get back into action, Bob gets his chance when a mysterious communication summons him to a remote island for a top secret assignment. He soon discovers that it will take a super family effort to rescue the world from total destruction.", "rottenTomatoes": "90/100", "imdbRating": "8.0", "Metascore": "90", "BoxOffice": "$261,441,092", "imdbVotes": "735,955", "criticConsensus": "Bringing loads of wit and tons of fun to the animated superhero genre, The Incredibles easily lives up to its name.", "Rank": "14", "Poster": "https://m.media-amazon.com/images/M/MV5BMTY5OTU0OTc2NV5BMl5BanBnXkFtZTcwMzU4MDcyMQ@@._V1_SX300.jpg"}, {"Title": "Big", "Year": "1988", "Rated": "PG", "Runtime": "104", "Genre": "Comedy, Drama, Fantasy", "Director": "Penny Marshall", "Plot": "Josh Baskin would do anything to be big to hang out with his crush at the carnival. He finds a Zoltar machine, and he wishes to be big. After Zoltar tells him, \"his wish is granted\", Josh notices the machine is unplugged. He wakes up the next morning in an adult's body but he still has the same personality. With the help of his best friend, Billy, Josh learns how to act like a grown up. But as he gets a girlfriend and a fun job, he doesn't want to be a kid again. Will Josh stay big or become a 13 year old boy again?", "rottenTomatoes": "97%", "imdbRating": "7.3", "Metascore": "73", "BoxOffice": "$115,227,281", "imdbVotes": "222,395", "criticConsensus": "Refreshingly sweet and undeniably funny, Big is a showcase for Tom Hanks, who dives into his role and infuses it with charm and surprising poignancy.", "Rank": "16", "Poster": "https://m.media-amazon.com/images/M/MV5BMDQ1ODM5MTMtMjAwYi00ZGUxLTliNTMtN2ZhODAwMjVhMTRlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SX300.jpg"}, {"Title": "Who Framed Roger Rabbit", "Year": "1988", "Rated": "PG", "Runtime": "104", "Genre": "Animation, Adventure, Comedy", "Director": "Robert Zemeckis", "Plot": "'Toon star Roger is worried that his wife Jessica is playing pattycake with someone else, so the studio hires detective Eddie Valiant to snoop on her. But the stakes are quickly raised when Marvin Acme is found dead and Roger is the prime suspect. Groundbreaking interaction between the live and animated characters, and lots of references to classic animation.", "rottenTomatoes": "97%", "imdbRating": "7.7", "Metascore": "83", "BoxOffice": "$156,452,370", "imdbVotes": "202,664", "criticConsensus": "Who Framed Roger Rabbit is an innovative and entertaining film that features a groundbreaking mix of live action and animation, with a touching and original story to boot.", "Rank": "17", "Poster": "https://m.media-amazon.com/images/M/MV5BMDhiOTM2OTctODk3Ny00NWI4LThhZDgtNGQ4NjRiYjFkZGQzXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SX300.jpg"}, {"Title": "Ratatouille", "Year": "2007", "Rated": "G", "Runtime": "111", "Genre": "Animation, Adventure, Comedy", "Director": "Brad Bird", "Plot": "A rat named Remy dreams of becoming a great French chef despite his family's wishes and the obvious problem of being a rat in a decidedly rodent-phobic profession. When fate places Remy in the sewers of Paris, he finds himself ideally situated beneath a restaurant made famous by his culinary hero, Auguste Gusteau. Despite the apparent dangers of being an unlikely, and certainly unwanted, visitor in the kitchen of a fine French restaurant, Remy's passion for cooking soon sets into motion a hilarious and exciting rat race that turns the culinary world of Paris upside down.", "rottenTomatoes": "96%", "imdbRating": "8.1", "Metascore": "96", "BoxOffice": "$206,445,654", "imdbVotes": "734,201", "criticConsensus": "Fast-paced and stunningly animated, Ratatouille adds another delightfully entertaining entry -- and a rather unlikely hero -- to the Pixar canon.", "Rank": "19", "Poster": "https://m.media-amazon.com/images/M/MV5BMTMzODU0NTkxMF5BMl5BanBnXkFtZTcwMjQ4MzMzMw@@._V1_SX300.jpg"}, {"Title": "Mary Poppins", "Year": "1964", "Rated": "G", "Runtime": "139", "Genre": "Comedy, Family, Fantasy", "Director": "Robert Stevenson", "Plot": "When Jane and Michael Banks are faced with the prospect of a new nanny, they are pleasantly surprised by the arrival of the magical Mary Poppins. Embarking on a series of fantastical adventures with he and her Cockney performer friend, Bert, they try to pass on some of her sunny attitude to their preoccupied parents.", "rottenTomatoes": "96%", "imdbRating": "7.8", "Metascore": "88", "BoxOffice": "$102,272,727", "imdbVotes": "173,731", "criticConsensus": "A lavish modern fairy tale celebrated for its amazing special effects, catchy songs, and Julie Andrews's legendary performance in the title role.", "Rank": "21", "Poster": "https://m.media-amazon.com/images/M/MV5BNmJkODczNjItNDI5Yy00MGI1LTkyOWItZDNmNjM4ZGI1ZDVlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_SX300.jpg"}, {"Title": "The Straight Story", "Year": "1999", "Rated": "G", "Runtime": "112", "Genre": "Biography, Drama", "Director": "David Lynch", "Plot": "Seventy-three year old Alvin Straight is a simple living and stubborn man who lives on his social security. He needs to do things on his own terms. He is in failing health. Both his hips are shot, which requires him to use two canes to walk. He is diabetic. He has emphysema from years of smoking. And he has poor eyesight. Beyond the obvious maladies, he doesn't tell his mentally disabled daughter Rose, who lives with him, of many of these issues. He learns that his brother Lyle Straight, from who he has been estranged for ten years, has just suffered a heart attack. Because of both his and Lyle's mortality, Alvin wants to make peace with his brother before it's too late, which means traveling from his home in the rural town of Laurens, Iowa to Lyle's home in rural Mount Zion, Wisconsin. As with other issues in his life, he needs to make the trip on his own terms, which means on his own. As he doesn't possess a driver's license and since his eyesight is bad, he decides to make the trip driving his aged riding lawn mover towing a trailer which will carry his gear and double as his sleeping quarters. After one mis-start, he is on his way. On that trip, he affects and is affected by those he encounters. But he just hopes that he can finish the trip the way he started it, and before either he, Lyle or the lawn mower give out for good.", "rottenTomatoes": "95%", "imdbRating": "8.0", "Metascore": "86", "BoxOffice": "$6,203,044", "imdbVotes": "91,112", "criticConsensus": "With strong performances and director David Lynch at the helm, The Straight Story steers past sentimental byways on its ambling journey across the American heartland.", "Rank": "27", "Poster": "https://m.media-amazon.com/images/M/MV5BM2UxYTMwMWUtOGM1OS00MDI4LWFhNTUtOTA4NWI2ZjEwNmMxXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_SX300.jpg"}, {"Title": "Fantasia", "Year": "1940", "Rated": "G", "Runtime": "125", "Genre": "Animation, Family, Fantasy", "Director": "James Algar, Samuel Armstrong, Ford Beebe, Norman Ferguson", "Plot": "Disney animators set pictures to Western classical music as Leopold Stokowski conducts the Philadelphia Orchestra. \"The Sorcerer's Apprentice\" features Mickey Mouse as an aspiring magician who oversteps his limits. \"The Rite of Spring\" tells the story of evolution, from single-celled animals to the death of the dinosaurs. \"Dance of the Hours\" is a comic ballet performed by ostriches, hippos, elephants, and alligators. \"Night on Bald Mountain\" and \"Ave Maria\" set the forces of darkness and light against each other as a devilish revel is interrupted by the coming of a new day.", "rottenTomatoes": "95%", "imdbRating": "7.7", "Metascore": "96", "BoxOffice": "$76,408,097", "imdbVotes": "97,231", "criticConsensus": "A landmark in animation (and a huge influence on the medium of music video), Disney's Fantasia is a relentlessly inventive blend of the classics with phantasmagorical images.", "Rank": "30", "Poster": "https://m.media-amazon.com/images/M/MV5BMjAxMTI1Njk3OF5BMl5BanBnXkFtZTgwNjkzODk4NTE@._V1_SX300.jpg"}, {"Title": "Star Wars: Episode V - The Empire Strikes Back", "Year": "1980", "Rated": "PG", "Runtime": "124", "Genre": "Action, Adventure, Fantasy", "Director": "Irvin Kershner", "Plot": "Luke Skywalker, Han Solo, Princess Leia and Chewbacca face attack by the Imperial forces and its AT-AT walkers on the ice planet Hoth. While Han and Leia escape in the Millennium Falcon, Luke travels to Dagobah in search of Yoda. Only with the Jedi Master's help will Luke survive when the Dark Side of the Force beckons him into the ultimate duel with Darth Vader.", "rottenTomatoes": "94%", "imdbRating": "8.7", "Metascore": "82", "BoxOffice": "$292,753,960", "imdbVotes": "1,287,175", "criticConsensus": "Dark, sinister, but ultimately even more involving than A New Hope, The Empire Strikes Back defies viewer expectations and takes the series to heightened emotional levels.", "Rank": "37", "Poster": "https://m.media-amazon.com/images/M/MV5BYmU1NDRjNDgtMzhiMi00NjZmLTg5NGItZDNiZjU5NTU4OTE0XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_SX300.jpg"}, {"Title": "Star Wars: Episode IV - A New Hope", "Year": "1977", "Rated": "PG", "Runtime": "121", "Genre": "Action, Adventure, Fantasy", "Director": "George Lucas", "Plot": "The Imperial Forces, under orders from cruel Darth Vader, hold Princess Leia hostage in their efforts to quell the rebellion against the Galactic Empire. Luke Skywalker and Han Solo, captain of the Millennium Falcon, work together with the companionable droid duo R2-D2 and C-3PO to rescue the beautiful princess, help the Rebel Alliance and restore freedom and justice to the Galaxy.", "rottenTomatoes": "93%", "imdbRating": "8.6", "Metascore": "90", "BoxOffice": "$460,998,507", "imdbVotes": "1,359,272", "criticConsensus": "A legendarily expansive and ambitious start to the sci-fi saga, George Lucas opened our eyes to the possibilities of blockbuster filmmaking and things have never been the same.", "Rank": "41", "Poster": "https://m.media-amazon.com/images/M/MV5BOTA5NjhiOTAtZWM0ZC00MWNhLThiMzEtZDFkOTk2OTU1ZDJkXkEyXkFqcGdeQXVyMTA4NDI1NTQx._V1_SX300.jpg"}, {"Title": "Star Wars: Episode VI - Return of the Jedi", "Year": "1983", "Rated": "PG", "Runtime": "131", "Genre": "Action, Adventure, Fantasy", "Director": "Richard Marquand", "Plot": "Luke Skywalker battles Jabba the Hutt and Darth Vader to save his comrades in the Rebel Alliance and triumph over the Galactic Empire. Han Solo and Princess Leia reaffirm their love, and team with Chewbacca, Lando Calrissian, the Ewoks, and droids C-3PO and R2-D2 to aid in the disruption of the Dark Side, and the defeat of the evil emperor.", "rottenTomatoes": "83%", "imdbRating": "8.3", "Metascore": "58", "BoxOffice": "$309,306,177", "imdbVotes": "1,050,753", "criticConsensus": "Though failing to reach the cinematic heights of its predecessors, Return of the Jedi remains an entertaining sci-fi adventure and a fitting end to the classic trilogy.", "Rank": "89", "Poster": "https://m.media-amazon.com/images/M/MV5BOWZlMjFiYzgtMTUzNC00Y2IzLTk1NTMtZmNhMTczNTk0ODk1XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SX300.jpg"}, {"Title": "The Sound of Music", "Year": "1965", "Rated": "G", "Runtime": "172", "Genre": "Biography, Drama, Family", "Director": "Robert Wise", "Plot": "In 1930's Austria, a young woman named Maria (Dame Julie Andrews) is failing miserably in her attempts to become a nun. When Navy Captain Georg Von Trapp (Christopher Plummer) writes to the convent asking for a governess that can handle his seven mischievous children, Maria is given the job. The Captain's wife is dead, and he is often away, and runs the household as strictly as he does the ships he sails on. The children are unhappy and resentful of the governesses that their father keeps hiring, and have managed to run each of them off one by one. When Maria arrives, she is initially met with the same hostility, but her kindness, understanding, and sense of fun soon draws them to her and brings some much-needed joy into all their lives - including the Captain's. Eventually he and Maria find themselves falling in love, even though the Captain is already engaged to a Baroness named Elsa and Maria is still a postulant. The romance makes them both start questioning the decisions they have made. Their personal conflicts soon become overshadowed, however, by world events. Austria is about to come under the control of Germany, and the Captain may soon find himself drafted into the German Navy and forced to fight against his own country.", "rottenTomatoes": "83%", "imdbRating": "8.1", "Metascore": "63", "BoxOffice": "$159,287,539", "imdbVotes": "234,681", "criticConsensus": "Unapologetically sweet and maybe even a little corny, The Sound of Music will win over all but the most cynical filmgoers with its classic songs and irresistible warmth.", "Rank": "90", "Poster": "https://m.media-amazon.com/images/M/MV5BODIxNjhkYjEtYzUyMi00YTNjLWE1YjktNjAyY2I2MWNkNmNmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg"}, {"Title": "Miracle", "Year": "2004", "Rated": "PG", "Runtime": "135", "Genre": "Biography, Drama, History", "Director": "Gavin O'Connor", "Plot": "The inspiring story of the team that transcended its sport and united a nation with a new feeling of hope. Based on the true story of one of the greatest moments in sports history, the tale captures a time and place where differences could be settled by games and a cold war could be put on ice. In 1980, the United States Ice Hockey team's coach, Herb Brooks, took a ragtag squad of college kids up against the legendary juggernaut from the Soviet Union at the Olympic Games. Despite the long odds, Team USA carried the pride of a nation yearning from a distraction from world events. With the world watching the team rose to the occasion, prompting broadcaster Al Michaels' now famous question, to the millions viewing at home: Do you believe in miracles? Yes!", "rottenTomatoes": "81%", "imdbRating": "7.4", "Metascore": "68", "BoxOffice": "$64,378,093", "imdbVotes": "55,249", "criticConsensus": "Kurt Russell's performance guides this cliche-ridden tale into the realm of inspirational, nostalgic goodness.", "Rank": "93", "Poster": "https://m.media-amazon.com/images/M/MV5BMjEyOTk1OTcyNV5BMl5BanBnXkFtZTYwNjMzNDU3._V1_SX300.jpg"}, {"Title": "While You Were Sleeping", "Year": "1995", "Rated": "PG", "Runtime": "103", "Genre": "Comedy, Drama, Romance", "Director": "Jon Turteltaub", "Plot": "Nursing a secret and hopeless crush on the handsome commuter who passes her booth every day, the charming loner and Chicago \"L\" ticket seller, Lucy, is about to have a second chance at love. During one seemingly ordinary Christmas shift, Lucy witnesses the object of her desire falling off the platform, and in one of those spur-of-the-moment decisions, she saves him from certain death, only to be mistaken for his fiancée at the hospital. As Lucy enjoys the unexpected stroke of good luck, unable to tell the truth to his welcoming family, unforeseen romantic affairs further complicate matters. Now, the comatose patient's suspicious brother, Jack, thinks he's onto something. Will Lucy face the consequences of what happened while the beautiful stranger was sleeping?", "rottenTomatoes": "81%", "imdbRating": "6.8", "Metascore": "67", "BoxOffice": "$81,057,016", "imdbVotes": "104,450", "criticConsensus": "While You Were Sleeping is built wholly from familiar ingredients, but assembled with such skill -- and with such a charming performance from Sandra Bullock -- that it gives formula a good name.", "Rank": "95", "Poster": "https://m.media-amazon.com/images/M/MV5BMGI5OGRiNTgtYzdkNS00N2E1LTgxMmQtYTQyNjk4YmEyM2IzXkEyXkFqcGdeQXVyNDQ0MTYzMDA@._V1_SX300.jpg"}], null, null], [[{"Title": "Toy Story 3", "Year": "2010", "Rated": "G", "Runtime": "103", "Genre": "Animation, Adventure, Comedy", "Director": "Lee Unkrich", "Plot": "Woody, Buzz and the whole gang are back. As their owner Andy prepares to depart for college, his loyal toys find themselves in daycare where untamed tots with their sticky little fingers do not play nice. So, it's all for one and one for all as they join Barbie's counterpart Ken, a thespian hedgehog named Mr. Pricklepants and a pink, strawberry-scented teddy bear called Lots-o'-Huggin' Bear to plan their great escape.", "rottenTomatoes": "98%", "imdbRating": "8.3", "Metascore": "92", "BoxOffice": "$415,004,880", "imdbVotes": "834,338", "criticConsensus": "Deftly blending comedy, adventure, and honest emotion, Toy Story 3 is a rare second sequel that really works.", "Rank": "6", "Poster": "https://m.media-amazon.com/images/M/MV5BMTgxOTY4Mjc0MF5BMl5BanBnXkFtZTcwNTA4MDQyMw@@._V1_SX300.jpg"}, {"Title": "Zootopia", "Year": "2016", "Rated": "PG", "Runtime": "108", "Genre": "Animation, Adventure, Comedy", "Director": "Byron Howard, Rich Moore", "Plot": "From the largest elephant to the smallest shrew, the city of Zootopia is a mammal metropolis where various animals live and thrive. When Judy Hopps becomes the first rabbit to join the police force, she quickly learns how tough it is to enforce the law. Determined to prove herself, Judy jumps at the opportunity to solve a mysterious case. Unfortunately, that means working with Nick Wilde, a wily fox who makes her job even harder.", "rottenTomatoes": "98%", "imdbRating": "8.0", "Metascore": "78", "BoxOffice": "$341,268,248", "imdbVotes": "498,454", "criticConsensus": "The brilliantly well-rounded Zootopia offers a thoughtful, inclusive message that's as rich and timely as its sumptuously state-of-the-art animation -- all while remaining fast and funny enough to keep younger viewers entertained.", "Rank": "7", "Poster": "https://m.media-amazon.com/images/M/MV5BOTMyMjEyNzIzMV5BMl5BanBnXkFtZTgwNzIyNjU0NzE@._V1_SX300.jpg"}, {"Title": "Toy Story 4", "Year": "2019", "Rated": "G", "Runtime": "100", "Genre": "Animation, Adventure, Comedy", "Director": "Josh Cooley", "Plot": "Woody, Buzz Lightyear and the rest of the gang embark on a road trip with Bonnie and a new toy named Forky. The adventurous journey turns into an unexpected reunion as Woody's slight detour leads him to his long-lost friend Bo Peep. As Woody and Bo discuss the old days, they soon start to realize that they're two worlds apart when it comes to what they want from life as a toy.", "rottenTomatoes": "97%", "imdbRating": "7.7", "Metascore": "84", "BoxOffice": "$434,038,008", "imdbVotes": "250,795", "criticConsensus": "Heartwarming, funny, and beautifully animated, Toy Story 4 manages the unlikely feat of extending -- and perhaps concluding -- a practically perfect animated saga.", "Rank": "12", "Poster": "https://m.media-amazon.com/images/M/MV5BMTYzMDM4NzkxOV5BMl5BanBnXkFtZTgwNzM1Mzg2NzM@._V1_SX300.jpg"}, {"Title": "Coco", "Year": "2017", "Rated": "PG", "Runtime": "105", "Genre": "Animation, Adventure, Comedy", "Director": "Lee Unkrich", "Plot": "Despite his family's baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.", "rottenTomatoes": "97%", "imdbRating": "8.4", "Metascore": "81", "BoxOffice": "$210,460,015", "imdbVotes": "504,838", "criticConsensus": "Coco's rich visual pleasures are matched by a thoughtful narrative that takes a family-friendly -- and deeply affecting -- approach to questions of culture, family, life, and death.", "Rank": "13", "Poster": "https://m.media-amazon.com/images/M/MV5BYjQ5NjM0Y2YtNjZkNC00ZDhkLWJjMWItN2QyNzFkMDE3ZjAxXkEyXkFqcGdeQXVyODIxMzk5NjA@._V1_SX300.jpg"}, {"Title": "Soul", "Year": "2020", "Rated": "PG", "Runtime": "100", "Genre": "Animation, Adventure, Comedy", "Director": "Pete Docter", "Plot": "Joe is a middle-school band teacher whose life hasn't quite gone the way he expected. His true passion is jazz and he's good. But when he travels to another realm to help someone find their passion, he soon discovers what it means to have soul.", "rottenTomatoes": "95%", "imdbRating": "8.0", "Metascore": "83", "BoxOffice": "N/A", "imdbVotes": "327,515", "criticConsensus": "A film as beautiful to contemplate as it is to behold, Soul proves Pixar's power to deliver outstanding all-ages entertainment remains undimmed.", "Rank": "23", "Poster": "https://m.media-amazon.com/images/M/MV5BZGE1MDg5M2MtNTkyZS00MTY5LTg1YzUtZTlhZmM1Y2EwNmFmXkEyXkFqcGdeQXVyNjA3OTI0MDc@._V1_SX300.jpg"}, {"Title": "Moana", "Year": "2016", "Rated": "PG", "Runtime": "107", "Genre": "Animation, Adventure, Comedy", "Director": "John Musker, Ron Clements", "Plot": "Moana Waialiki is a sea voyaging enthusiast and the only daughter of a chief in a long line of navigators. When her island's fishermen can't catch any fish and the crops fail, she learns that the demigod Maui caused the blight by stealing the heart of the goddess, Te Fiti. The only way to heal the island is to persuade Maui to return Te Fiti's heart, so Moana sets off on an epic journey across the Pacific. The film is based on stories from Polynesian mythology.", "rottenTomatoes": "95%", "imdbRating": "7.6", "Metascore": "81", "BoxOffice": "$248,757,044", "imdbVotes": "335,336", "criticConsensus": "With a title character as three-dimensional as its lush animation and a story that adds fresh depth to Disney's time-tested formula, Moana is truly a family-friendly adventure for the ages.", "Rank": "24", "Poster": "https://m.media-amazon.com/images/M/MV5BMjI4MzU5NTExNF5BMl5BanBnXkFtZTgwNzY1MTEwMDI@._V1_SX300.jpg"}, {"Title": "The Muppets", "Year": "2011", "Rated": "PG", "Runtime": "103", "Genre": "Adventure, Comedy, Family", "Director": "James Bobin", "Plot": "When 3 Muppet fans learn that Tex Richman wants to drill under the Muppet Theater for oil, Gary, Mary and Walter set out to find the Muppets who have been split up for years so that they can put on one last show and save the Muppet Theater. Kermit the Frog now lives in his own mansion depressed in Hollywood, 'The Great Gonzo' is a high class plumber at Gonzo's Royal Flush, Fozzie Bear performs with a tribute band called The Moopets, Miss Piggy is the plus-size fashion editor at Vogue Paris, and Animal is at a celebrity anger management rehab center in Santa Barbara.", "rottenTomatoes": "95%", "imdbRating": "7.1", "Metascore": "75", "BoxOffice": "$88,631,237", "imdbVotes": "93,205", "criticConsensus": "Clever, charming, and heartfelt, The Muppets is a welcome big screen return for Jim Henson's lovable creations that will both win new fans and delight longtime devotees.", "Rank": "26", "Poster": "https://m.media-amazon.com/images/M/MV5BMjE0MTM4NTc3NF5BMl5BanBnXkFtZTcwMjYzOTIxNg@@._V1_SX300.jpg"}, {"Title": "Raya and the Last Dragon", "Year": "2021", "Rated": "PG", "Runtime": "107", "Genre": "Animation, Action, Adventure", "Director": "Don Hall, Carlos López Estrada", "Plot": "Long ago, in the fantasy world of Kumandra, humans and dragons lived together in harmony. However, when sinister monsters known as the Druun threatened the land, the dragons sacrificed themselves to save humanity. Now, 500 years later, those same monsters have returned, and it's up to a lone warrior to track down the last dragon and stop the Druun for good.", "rottenTomatoes": "94%", "imdbRating": "7.3", "Metascore": "74", "BoxOffice": "$54,723,032", "imdbVotes": "151,063", "criticConsensus": "Another gorgeously animated, skillfully voiced entry in the Disney canon, Raya and the Last Dragon continues the studio's increased representation while reaffirming that its classic formula is just as reliable as ever.", "Rank": "33", "Poster": "https://m.media-amazon.com/images/M/MV5BZWNiOTc4NGItNGY4YS00ZGNkLThkOWEtMDE2ODcxODEwNjkwXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_SX300.jpg"}, {"Title": "Queen of Katwe", "Year": "2016", "Rated": "PG", "Runtime": "124", "Genre": "Biography, Drama, Sport", "Director": "Mira Nair", "Plot": "Living in Katwe, a slum in Kampala, Uganda, is a constant struggle for 10-year-old Phiona, her mother Nakku Harriet, and her younger family members. She and her younger brother help their mother sell maize in the market. She also helps care for her baby brother. Her world changes the day she meets Robert Katende at a missionary program. Katende coaches soccer and teaches children to play chess at a local center. Curious, Phiona visits the center, learns the game, and becomes fascinated with it. She becomes a top player in the group under Katende's guidance.", "rottenTomatoes": "94%", "imdbRating": "7.4", "Metascore": "73", "BoxOffice": "$8,874,389", "imdbVotes": "17,615", "criticConsensus": "Queen of Katwe is a feel-good movie of uncommon smarts and passion, and outstanding performances by Lupita Nyong'o and David Oyelowo help to elevate the film past its cliches.", "Rank": "35", "Poster": "https://m.media-amazon.com/images/M/MV5BNzQ0MDg2NTY4N15BMl5BanBnXkFtZTgwOTk2NzU3OTE@._V1_SX300.jpg"}, {"Title": "Encanto", "Year": "2021", "Rated": "PG", "Runtime": "102", "Genre": "Animation, Comedy, Family", "Director": "Jared Bush, Byron Howard", "Plot": "Encanto tells the tale of an extraordinary family, the Madrigals, who live hidden in the mountains of Colombia, in a magical house, in a vibrant town, in a wondrous, charmed place called an Encanto. The magic of the Encanto has blessed every child in the family with a unique gift from super strength to the power to heal-every child except one, Mirabel. But when she discovers that the magic surrounding the Encanto is in danger, Mirabel decides that she, the only ordinary Madrigal, might just be her exceptional family's last hope.", "rottenTomatoes": "75/100", "imdbRating": "7.2", "Metascore": "75", "BoxOffice": "$96,093,622", "imdbVotes": "219,554", "criticConsensus": "Encanto's setting and cultural perspective are new for Disney, but the end result is the same -- enchanting, beautifully animated fun for the whole family.", "Rank": "51", "Poster": "https://m.media-amazon.com/images/M/MV5BNjE5NzA4ZDctOTJkZi00NzM0LTkwOTYtMDI4MmNkMzIxODhkXkEyXkFqcGdeQXVyNjY1MTg4Mzc@._V1_SX300.jpg"}, {"Title": "Frozen", "Year": "2013", "Rated": "PG", "Runtime": "102", "Genre": "Animation, Adventure, Comedy", "Director": "Chris Buck, Jennifer Lee", "Plot": "Fearless optimist Anna teams up with rugged mountain man Kristoff and his loyal reindeer Sven and sets off on an epic journey to find her sister Elsa, whose icy powers have trapped the kingdom of Arendelle in eternal winter. Encountering Everest-like conditions, mystical trolls and a hilarious snowman named Olaf, Anna and Kristoff battle the elements in a race to save the kingdom. From the outside Elsa looks poised, regal and reserved, but in reality she lives in fear as she wrestles with a mighty secret: she was born with the power to create ice and snow. It's a beautiful ability, but also extremely dangerous. Haunted by the moment her magic nearly killed her younger sister Anna, Elsa has isolated herself, spending every waking minute trying to suppress her growing powers. Her mounting emotions trigger the magic, accidentally setting off an eternal winter that she can't stop. She fears she's becoming a monster and that no one, not even her sister, can help her.", "rottenTomatoes": "90%", "imdbRating": "7.4", "Metascore": "75", "BoxOffice": "$400,953,009", "imdbVotes": "624,543", "criticConsensus": "Beautifully animated, smartly written, and stocked with singalong songs, Frozen adds another worthy entry to the Disney canon.", "Rank": "59", "Poster": "https://m.media-amazon.com/images/M/MV5BMTQ1MjQwMTE5OF5BMl5BanBnXkFtZTgwNjk3MTcyMDE@._V1_SX300.jpg"}, {"Title": "Big Hero 6", "Year": "2014", "Rated": "PG", "Runtime": "102", "Genre": "Animation, Action, Adventure", "Director": "Don Hall, Chris Williams", "Plot": "When a devastating event befalls the city of San Fransokyo and catapults Hiro into the midst of danger, he turns to Baymax and his close friends adrenaline junkie Go Go Tomago, neatnik Wasabi, chemistry whiz Honey Lemon and fanboy Fred. Determined to uncover the mystery, Hiro transforms his friends into a band of high-tech heroes called \"Big Hero 6.\"", "rottenTomatoes": "90%", "imdbRating": "7.8", "Metascore": "74", "BoxOffice": "$222,527,828", "imdbVotes": "461,943", "criticConsensus": "Agreeably entertaining and brilliantly animated, Big Hero 6 is briskly-paced, action-packed, and often touching.", "Rank": "60", "Poster": "https://m.media-amazon.com/images/M/MV5BMDliOTIzNmUtOTllOC00NDU3LWFiNjYtMGM0NDc1YTMxNjYxXkEyXkFqcGdeQXVyNTM3NzExMDQ@._V1_SX300.jpg"}, {"Title": "Tangled", "Year": "2010", "Rated": "PG", "Runtime": "100", "Genre": "Animation, Adventure, Comedy", "Director": "Nathan Greno, Byron Howard", "Plot": "After receiving the healing powers from a magical flower, the baby Princess Rapunzel is kidnapped from the palace in the middle of the night by Mother Gothel. Mother Gothel knows that the flower's magical powers are now growing within the golden hair of Rapunzel, and to stay young, she must lock Rapunzel in her hidden tower. Rapunzel is now a teenager and her hair has grown to a length of 70-feet. The beautiful Rapunzel has been in the tower her entire life, and she is curious of the outside world. One day, the bandit Flynn Ryder scales the tower and is taken captive by Rapunzel. Rapunzel strikes a deal with the charming thief to act as her guide to travel to the place where the floating lights come from that she has seen every year on her birthday. Rapunzel is about to have the most exciting and magnificent journey of her life.", "rottenTomatoes": "89%", "imdbRating": "7.7", "Metascore": "71", "BoxOffice": "$200,821,936", "imdbVotes": "453,887", "criticConsensus": "While far from Disney's greatest film, Tangled is a visually stunning, thoroughly entertaining addition to the studio's classic animated canon.", "Rank": "64", "Poster": "https://m.media-amazon.com/images/M/MV5BMTAxNDYxMjg0MjNeQTJeQWpwZ15BbWU3MDcyNTk2OTM@._V1_SX300.jpg"}, {"Title": "Onward", "Year": "2020", "Rated": "PG", "Runtime": "102", "Genre": "Animation, Adventure, Comedy", "Director": "Dan Scanlon", "Plot": "In a suburban fantasy world, two teenage elf brothers, Ian and Barley Lightfoot, go on a journey to discover if there is still a little magic left out there in order to spend one last day with their father, who died when they were too young to remember him. Like any good quest, their journey is filled with magic spells, cryptic maps, impossible obstacles and unimaginable discoveries. When the boys' fearless mom, Laurel, realizes that her sons are missing, she teams up with the legendary winged-lion-scorpion former warrior -- The Manticore -- and heads off to find them. Perilous curses aside, this one magical day could mean more than any of them ever dreamed.", "rottenTomatoes": "88%", "imdbRating": "7.4", "Metascore": "61", "BoxOffice": "$61,555,145", "imdbVotes": "149,804", "criticConsensus": "It may suffer in comparison to Pixar's classics, but Onward makes effective use of the studio's formula -- and stands on its own merits as a funny, heartwarming, dazzlingly animated adventure.", "Rank": "69", "Poster": "https://m.media-amazon.com/images/M/MV5BMTZlYzk3NzQtMmViYS00YWZmLTk5ZTEtNWE0NGVjM2MzYWU1XkEyXkFqcGdeQXVyNDg4NjY5OTQ@._V1_SX300.jpg"}, {"Title": "Pete's Dragon", "Year": "2016", "Rated": "PG", "Runtime": "102", "Genre": "Action, Adventure, Comedy", "Director": "David Lowery", "Plot": "A young boy, Pete, is found in a forest where he's been living for six year after an accident took his parents' lives. A ranger, Grace, takes him in and asks him how he survived all by himself. He says he had a friend named Elliott and draws a picture of a dragon, saying it's Elliott. Grace takes the picture to her father who claims that years ago he encountered a dragon in the forest. Grace takes Pete back to the forest and he shows her his home and Elliott. A man sees Elliott, and when he tells about his experience and isn't believed, he sets out to capture the dragon to prove it.", "rottenTomatoes": "88%", "imdbRating": "6.7", "Metascore": "71", "BoxOffice": "$76,233,151", "imdbVotes": "58,861", "criticConsensus": "Pete's Dragon continues Disney's current live-action winning streak with an update that gives the original a visual overhaul without overwhelming its sweet, soulful charm.", "Rank": "70", "Poster": "https://m.media-amazon.com/images/M/MV5BNWE3MzRiMjctMzFmNy00ZmU2LWEyNTctMTcyZjUxYjVjZTE0XkEyXkFqcGdeQXVyNjcwNTE2NTY@._V1_SX300.jpg"}, {"Title": "The Jungle Book", "Year": "2016", "Rated": "PG", "Runtime": "106", "Genre": "Adventure, Drama, Family", "Director": "Wolfgang Reitherman", "Plot": "Living among the wolves in the jungle, young man cub Mowgli quickly learns to live life among his wolf pack and all the animals that inhabit the jungle, but when the villainous tiger Shere Khan threatens Mowgli's life, black panther Bagheera offers to take Mowgli to a nearby man village where he will be safe from the tiger's wrath. Along the way, Mowgli gets tangled up in a series of encounters with a sly snake named Kaa, a swimmingly ruthless gigantopithecus named King Louie and a lazy bear named Baloo, who quickly becomes his guide to the 'bear necessities' of life.", "rottenTomatoes": "94%", "imdbRating": "7.4", "Metascore": "77", "BoxOffice": "$364,001,123", "imdbVotes": "278,291", "criticConsensus": "With expressive animation, fun characters, and catchy songs, The Jungle Book endures as a crowd-pleasing Disney classic.", "Rank": "74", "Poster": "https://m.media-amazon.com/images/M/MV5BMTc3NTUzNTI4MV5BMl5BanBnXkFtZTgwNjU0NjU5NzE@._V1_SX300.jpg"}, {"Title": "Mary Poppins Returns", "Year": "2018", "Rated": "PG", "Runtime": "130", "Genre": "Adventure, Comedy, Family", "Director": "Rob Marshall", "Plot": "In Depression-era London, a now-grown Jane (Emily Mortimer) and Michael Banks (Ben Whishaw), along with Michael's three children, are visited by the enigmatic Mary Poppins (Emily Blunt) following a personal loss. Through her unique magical skills, and with the aid of her friend Jack (Lin-Manuel Miranda), she helps the family rediscover the joy and wonder missing in their lives.", "rottenTomatoes": "80%", "imdbRating": "6.7", "Metascore": "66", "BoxOffice": "$171,958,438", "imdbVotes": "88,803", "criticConsensus": "Mary Poppins Returns relies on the magic of its classic forebear to cast a familiar -- but still solidly effective -- family-friendly spell.", "Rank": "96", "Poster": "https://m.media-amazon.com/images/M/MV5BMjQxNjE3NjYxN15BMl5BanBnXkFtZTgwMTk2NDQ3NjM@._V1_SX300.jpg"}, {"Title": "Monsters University", "Year": "2013", "Rated": "G", "Runtime": "104", "Genre": "Animation, Adventure, Comedy", "Director": "Dan Scanlon", "Plot": "Mike Wazowski (Billy Crystal) and James P. \"Sully\" Sullivan (John Goodman) are an inseparable pair, but that wasn't always the case. From the moment these two mismatched monsters met, they couldn't stand each other. This movie unlocks the door to how Mike and Sully overcame their differences and became the best of friends.", "rottenTomatoes": "80%", "imdbRating": "7.2", "Metascore": "65", "BoxOffice": "$268,492,764", "imdbVotes": "360,944", "criticConsensus": "Offering Monsters, Inc. fans a return visit with beloved characters, Monsters University delivers funny and thoughtful family entertainment for viewers of any age.", "Rank": "99", "Poster": "https://m.media-amazon.com/images/M/MV5BMTUyODgwMDU3M15BMl5BanBnXkFtZTcwOTM4MjcxOQ@@._V1_SX300.jpg"}], null, null]], ["Do you want to watch a movie that is over 15 years old (yes/no)?", [[{"Title": "Toy Story 2", "Year": "1999", "Rated": "G", "Runtime": "92", "Genre": "Animation, Adventure, Comedy", "Director": "Ash Brannon, John Lasseter, Lee Unkrich", "Plot": "While Andy is away at summer camp Woody has been toynapped by Al McWiggin, a greedy collector and proprietor of \"Al's Toy Barn\"! In this all-out rescue mission, Buzz and his friends Mr. Potato Head, Slinky Dog, Rex and Hamm springs into action to rescue Woody from winding up as a museum piece. They must find a way to save him before he gets sold in Japan forever and they'll never see him again!", "rottenTomatoes": "100%", "imdbRating": "7.9", "Metascore": "88", "BoxOffice": "$245,852,179", "imdbVotes": "581,219", "criticConsensus": "The rare sequel that arguably improves on its predecessor, Toy Story 2 uses inventive storytelling, gorgeous animation, and a talented cast to deliver another rich moviegoing experience for all ages.", "Rank": "1", "Poster": "https://m.media-amazon.com/images/M/MV5BMWM5ZDcxMTYtNTEyNS00MDRkLWI3YTItNThmMGExMWY4NDIwXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_SX300.jpg"}, {"Title": "Toy Story", "Year": "1995", "Rated": "G", "Runtime": "81", "Genre": "Animation, Adventure, Comedy", "Director": "John Lasseter", "Plot": "A little boy named Andy loves to be in his room, playing with his toys, especially his doll named \"Woody\". But, what do the toys do when Andy is not with them, they come to life. Woody believes that his life (as a toy) is good. However, he must worry about Andy's family moving, and what Woody does not know is about Andy's birthday party. Woody does not realize that Andy's mother gave him an action figure known as Buzz Lightyear, who does not believe that he is a toy, and quickly becomes Andy's new favorite toy. Woody, who is now consumed with jealousy, tries to get rid of Buzz. Then, both Woody and Buzz are now lost. They must find a way to get back to Andy before he moves without them, but they will have to pass through a ruthless toy killer, Sid Phillips.", "rottenTomatoes": "100%", "imdbRating": "8.3", "Metascore": "95", "BoxOffice": "$223,225,679", "imdbVotes": "990,679", "criticConsensus": "Entertaining as it is innovative, Toy Story reinvigorated animation while heralding the arrival of Pixar as a family-friendly force to be reckoned with.", "Rank": "2", "Poster": "https://m.media-amazon.com/images/M/MV5BMDU2ZWJlMjktMTRhMy00ZTA5LWEzNDgtYmNmZTEwZTViZWJkXkEyXkFqcGdeQXVyNDQ2OTk4MzI@._V1_SX300.jpg"}, {"Title": "Pinocchio", "Year": "1940", "Rated": "G", "Runtime": "88", "Genre": "Animation, Adventure, Comedy", "Director": "Ben Sharpsteen, Hamilton Luske", "Plot": "Inventor Gepetto creates a wooden marionette called Pinocchio. His wish for Pinocchio to be a real boy is unexpectedly granted by a fairy. The fairy assigns Jiminy Cricket to act as Pinocchio's \"conscience\" and keep him out of trouble. Jiminy is not too successful in this endeavor and most of the film is spent with Pinocchio deep in trouble.", "rottenTomatoes": "100%", "imdbRating": "7.5", "Metascore": "99", "BoxOffice": "$84,254,167", "imdbVotes": "147,806", "criticConsensus": "Ambitious, adventurous, and sometimes frightening, Pinocchio arguably represents the pinnacle of Disney's collected works -- it's beautifully crafted and emotionally resonant.", "Rank": "3", "Poster": "https://m.media-amazon.com/images/M/MV5BMTU4Mzk3ODIyOF5BMl5BanBnXkFtZTgwODgyNzk2NjE@._V1_SX300.jpg"}, {"Title": "One Hundred and One Dalmatians", "Year": "1961", "Rated": "G", "Runtime": "79", "Genre": "Animation, Adventure, Comedy", "Director": "Wolfgang Reitherman, Hamilton S. Luske, Clyde Geronimi", "Plot": "Pongo and Perdita have a litter of 15 puppies. Cruella De Vil takes a fancy to the pups, and wants to get hold of them, as well as more pups, to make herself a lovely dalmatian skin coat... Cruella hires some thugs to kidnap the pups and hold them at her mansion. Will Pongo and Perdita find them in time ?", "rottenTomatoes": "98%", "imdbRating": "7.3", "Metascore": "83", "BoxOffice": "$144,880,014", "imdbVotes": "169,343", "criticConsensus": "With plenty of pooches and a memorable villain (Cruella De Vil), this is one of Disney's most enduring, entertaining animated films.", "Rank": "10", "Poster": "https://m.media-amazon.com/images/M/MV5BZGMyMjE4OGUtNGZmMC00YzdmLThkMWYtZWIzMmEzNjA4MzVkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg"}, {"Title": "Dumbo", "Year": "1941", "Rated": "G", "Runtime": "64", "Genre": "Animation, Adventure, Drama", "Director": "Ben Sharpsteen", "Plot": "The stork delivers a baby elephant to Mrs. Jumbo, veteran of the circus, but the newborn is ridiculed because of his truly enormous ears and dubbed \"Dumbo\". After being separated from his mother, Dumbo is relegated to the circus' clown acts; it is up to his only friend, a mouse, to assist Dumbo to achieve his full potential.", "rottenTomatoes": "98%", "imdbRating": "7.2", "Metascore": "96", "BoxOffice": "N/A", "imdbVotes": "133,090", "criticConsensus": "Dumbo packs plenty of story into its brief runtime, along with all the warm animation and wonderful music you'd expect from a Disney classic.", "Rank": "11", "Poster": "https://m.media-amazon.com/images/M/MV5BNWVmNWQ2OTQtNzJlNC00ZmQwLTg4ZTktZTNmM2IxZTlkOGM3L2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SX300.jpg"}, {"Title": "The Princess Bride", "Year": "1987", "Rated": "PG", "Runtime": "98", "Genre": "Adventure, Family, Fantasy", "Director": "Rob Reiner", "Plot": "An elderly man reads the book \"The Princess Bride\" to his sick and thus currently bedridden adolescent grandson, the reading of the book which has been passed down within the family for generations. The grandson is sure he won't like the story, with a romance at its core, he prefers something with lots of action and \"no kissing\", but he lets grandfather continue, because he doesn't want to hurt his feelings. The story centers on Buttercup, a former farm girl who has been chosen as the princess bride to Prince Humperdinck of Florian. Buttercup does not love him, she who still laments the death of her one true love, Westley, five years ago. Westley was a hired hand on the farm, his stock answer of \"as you wish\" to any request she made of him which she came to understand was his way of saying that he loved her. But Westley went away to sea, only to be killed by the Dread Pirate Roberts. On a horse ride to clear her mind of her upcoming predicament of marriage, Buttercup is kidnapped by a band of bandits: Vizzini who works on his wits, and his two associates, a giant named Fezzik who works on his brawn, and a Spaniard named Inigo Montoya, who has trained himself his entire life to be an expert swordsman. They in turn are chased by the Dread Pirate Roberts himself. But chasing them all is the Prince, and his men led by Count Tyrone Rugen. What happens to these collectives is dependent partly on Buttercup, who does not want to marry the Prince, and may see other options as lesser evils, and partly on the other motives of individuals within the groups. But a larger question is what the grandson will think of the story as it proceeds and at its end, especially as he sees justice as high a priority as action.", "rottenTomatoes": "97%", "imdbRating": "8.0", "Metascore": "77", "BoxOffice": "$30,857,814", "imdbVotes": "427,530", "criticConsensus": "A delightfully postmodern fairy tale, The Princess Bride is a deft, intelligent mix of swashbuckling, romance, and comedy that takes an age-old damsel-in-distress story and makes it fresh.", "Rank": "15", "Poster": "https://m.media-amazon.com/images/M/MV5BYzdiOTVjZmQtNjAyNy00YjA2LTk5ZTAtNmJkMGQ5N2RmNjUxXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_SX300.jpg"}, {"Title": "Monsters, Inc.", "Year": "2001", "Rated": "G", "Runtime": "92", "Genre": "Animation, Adventure, Comedy", "Director": "Pete Docter", "Plot": "A city of monsters with no humans called Monstropolis centers around the city's power company, Monsters, Inc. The lovable, confident, tough, furry blue behemoth-like giant monster named James P. Sullivan (better known as Sulley) and his wisecracking best friend, short, green cyclops monster Mike Wazowski, discover what happens when the real world interacts with theirs in the form of a 2-year-old baby girl dubbed \"Boo,\" who accidentally sneaks into the monster world with Sulley one night. And now it's up to Sulley and Mike to send Boo back in her door before anybody finds out, especially two evil villains such as Sulley's main rival as a scarer, chameleon-like Randall (a monster that Boo is very afraid of), who possesses the ability to change the color of his skin, and Mike and Sulley's boss Mr. Waternoose, the chairman and chief executive officer of Monsters, Inc.", "rottenTomatoes": "96%", "imdbRating": "8.1", "Metascore": "79", "BoxOffice": "$290,642,256", "imdbVotes": "905,840", "criticConsensus": "Clever, funny, and delightful to look at, Monsters, Inc. delivers another resounding example of how Pixar elevated the bar for modern all-ages animation.", "Rank": "20", "Poster": "https://m.media-amazon.com/images/M/MV5BMTY1NTI0ODUyOF5BMl5BanBnXkFtZTgwNTEyNjQ0MDE@._V1_SX300.jpg"}, {"Title": "The Nightmare Before Christmas", "Year": "1993", "Rated": "PG", "Runtime": "76", "Genre": "Animation, Family, Fantasy", "Director": "Henry Selick", "Plot": "Jack Skellington, the pumpkin king of Halloween Town, is bored with doing the same thing every year for Halloween. One day he stumbles into Christmas Town, and is so taken with the idea of Christmas that he tries to get the resident bats, ghouls, and goblins of Halloween Town to help him put on Christmas instead of Halloween -- but alas, they can't get it quite right.", "rottenTomatoes": "95%", "imdbRating": "7.9", "Metascore": "82", "BoxOffice": "$77,368,668", "imdbVotes": "340,207", "criticConsensus": "The Nightmare Before Christmas is a stunningly original and visually delightful work of stop-motion animation.", "Rank": "28", "Poster": "https://m.media-amazon.com/images/M/MV5BNWE4OTNiM2ItMjY4Ni00ZTViLWFiZmEtZGEyNGY2ZmNlMzIyXkEyXkFqcGdeQXVyMDU5NDcxNw@@._V1_SX300.jpg"}, {"Title": "Aladdin", "Year": "1992", "Rated": "G", "Runtime": "90", "Genre": "Animation, Adventure, Comedy", "Director": "Ron Clements, John Musker", "Plot": "Aladdin is a poor street urchin who spends his time stealing food from the marketplace in the city of Agrabah. His adventures begin when he meets a young girl who happens to be Princess Jasmine, who is forced to be married by her wacky yet estranged father. Aladdin's luck suddenly changes when he retrieves a magical lamp from the Cave of Wonders. What he unwittingly gets is a fun-loving genie who only wishes to have his freedom. Little do they know is that the Sultan's sinister advisor Jafar has his own plans for both Aladdin and the lamp.", "rottenTomatoes": "95%", "imdbRating": "8.0", "Metascore": "86", "BoxOffice": "$217,350,219", "imdbVotes": "420,013", "criticConsensus": "A highly entertaining entry in Disney's renaissance era,\" Aladdin is beautifully drawn, with near-classic songs and a cast of scene-stealing characters.", "Rank": "29", "Poster": "https://m.media-amazon.com/images/M/MV5BY2Q2NDI1MjUtM2Q5ZS00MTFlLWJiYWEtNTZmNjQ3OGJkZDgxXkEyXkFqcGdeQXVyNTI4MjkwNjA@._V1_SX300.jpg"}, {"Title": "Beauty and the Beast", "Year": "1991", "Rated": "G", "Runtime": "84", "Genre": "Animation, Family, Fantasy", "Director": "Gary Trousdale, Kirk Wise", "Plot": "Having lived a life in selfishness, young Prince Adam is cursed by a mysterious enchantress to having the appearance of a monstrous beast. His only hope is to learn to love a young woman and earn her love in return in order to redeem himself. Ten years later, his chance shows itself when a young maiden named Belle (Paige O'Hara) offers to take her ill father Maurice's (Rex Everhart's) place as his prisoner. With help from the castle's enchanted staff, Belle learns to appreciate her captor and immediately falls in love with him. Back in the village however, unscrupulous hunter Gaston (Richard White) has his own plans for Belle.", "rottenTomatoes": "94%", "imdbRating": "8.0", "Metascore": "95", "BoxOffice": "$218,967,620", "imdbVotes": "455,101", "criticConsensus": "Enchanting, sweepingly romantic, and featuring plenty of wonderful musical numbers, Beauty and the Beast is one of Disney's most elegant animated offerings.", "Rank": "36", "Poster": "https://m.media-amazon.com/images/M/MV5BMzE5MDM1NDktY2I0OC00YWI5LTk2NzUtYjczNDczOWQxYjM0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg"}, {"Title": "The Lion King", "Year": "1994", "Rated": "G", "Runtime": "88", "Genre": "Animation, Adventure, Drama", "Director": "Roger Allers, Rob Minkoff", "Plot": "A young lion prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron paw, the prince grows up beyond the Savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young prince must decide his fate: Will he remain an outcast or face his demons and become what he needs to be?", "rottenTomatoes": "93%", "imdbRating": "8.5", "Metascore": "88", "BoxOffice": "$422,783,777", "imdbVotes": "1,052,735", "criticConsensus": "Emotionally stirring, richly drawn, and beautifully animated, The Lion King is a pride within Disney's pantheon of classic family films.", "Rank": "42", "Poster": "https://m.media-amazon.com/images/M/MV5BYTYxNGMyZTYtMjE3MS00MzNjLWFjNmYtMDk3N2FmM2JiM2M1XkEyXkFqcGdeQXVyNjY5NDU4NzI@._V1_SX300.jpg"}, {"Title": "The Little Mermaid", "Year": "1989", "Rated": "G", "Runtime": "83", "Genre": "Animation, Adventure, Comedy", "Director": "Ron Clements, John Musker", "Plot": "In Disney's beguiling animated romp, rebellious 16-year-old mermaid Ariel is fascinated with life on land. On one of her visits to the surface, which are forbidden by her controlling father, King Triton, she falls for a human prince. Determined to be with her new love, Ariel makes a dangerous deal with the sea witch Ursula to become human for three days. But when plans go awry for the star-crossed lovers, the king must make the ultimate sacrifice for his daughter.", "rottenTomatoes": "93%", "imdbRating": "7.6", "Metascore": "88", "BoxOffice": "$111,543,479", "imdbVotes": "264,543", "criticConsensus": "The Little Mermaid ushered in a new golden era for Disney animation with warm and charming hand-drawn characters and catchy musical sequences.", "Rank": "43", "Poster": "https://m.media-amazon.com/images/M/MV5BN2JlZTBhYTEtZDE3OC00NTA3LTk5NTQtNjg5M2RjODllM2M0XkEyXkFqcGdeQXVyNjk1Njg5NTA@._V1_SX300.jpg"}, {"Title": "Lady and the Tramp", "Year": "1955", "Rated": "G", "Runtime": "76", "Genre": "Animation, Adventure, Comedy", "Director": "Clyde Geronimi, Wilfred Jackson, Hamilton Luske", "Plot": "Lady, a golden cocker spaniel, meets up with a mongrel dog who calls himself the Tramp. He is obviously from the wrong side of town, but happenings at Lady's home make her decide to travel with him for a while. This turns out to be a bad move, as no dog is above the law.", "rottenTomatoes": "93%", "imdbRating": "7.3", "Metascore": "78", "BoxOffice": "$93,602,326", "imdbVotes": "136,795", "criticConsensus": "A nostalgic charmer, Lady and the Tramp's token sweetness is mighty but the songs and richly colored animation are technically superb and make for a memorable experience.", "Rank": "44", "Poster": "https://m.media-amazon.com/images/M/MV5BODk4YWI2MzItYzc2Yi00M2U0LWFhY2MtOTgyODM2NWE0MDcyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg"}, {"Title": "A Bug's Life", "Year": "1998", "Rated": "G", "Runtime": "95", "Genre": "Animation, Adventure, Comedy", "Director": "John Lasseter, Andrew Stanton", "Plot": "At an annual pace, a huge colony of ants is forced to collect every piece of food that grows on their island for a group of menacing grasshoppers. But that all changes when a misfit inventor ant named Flik accidentally knocks over the offering pile thus forcing the grasshoppers' devious leader Hopper to force the ants to redo their gathering of food. Despite the fact that his friends don't believe him and desperate to help save the colony, Flik volunteers to go out into the world and search for a group of 'warrior' bugs. Instead, what he got was a talented group of circus performers. But when the grasshoppers return and take control of the island, Flik must prove himself a true hero before it's too late.", "rottenTomatoes": "92%", "imdbRating": "7.2", "Metascore": "77", "BoxOffice": "$162,798,565", "imdbVotes": "294,234", "criticConsensus": "A Bug's Life is a rousing adventure that blends animated thrills with witty dialogue and memorable characters - and another smashing early success for Pixar.", "Rank": "46", "Poster": "https://m.media-amazon.com/images/M/MV5BNThmZGY4NzgtMTM4OC00NzNkLWEwNmEtMjdhMGY5YTc1NDE4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg"}, {"Title": "James and the Giant Peach", "Year": "1996", "Rated": "PG", "Runtime": "79", "Genre": "Animation, Adventure, Family", "Director": "Henry Selick", "Plot": "James' happy life at the English seaside is rudely ended when his parents are killed by a rhinoceros and he goes to live with his two horrid aunts. Daringly saving the life of a spider he comes into possession of magic boiled crocodile tongues, after which an enormous peach starts to grow in the garden. Venturing inside, he meets not only the spider but a number of new friends including a ladybug and a centipede who help him with his plan to try to get to New York.", "rottenTomatoes": "91%", "imdbRating": "6.7", "Metascore": "78", "BoxOffice": "$28,946,127", "imdbVotes": "68,822", "criticConsensus": "The arresting and dynamic visuals, offbeat details and light-as-air storytelling make James and the Giant Peach solid family entertainment.", "Rank": "52", "Poster": "https://m.media-amazon.com/images/M/MV5BMTNkNWIwNGUtNTJlOC00NDU3LTk0NWEtNjNjNDM4NzRiNThkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg"}, {"Title": "Bambi", "Year": "1942", "Rated": "G", "Runtime": "69", "Genre": "Animation, Adventure, Drama", "Director": "David Hand", "Plot": "It's spring, and all the animals of the forest are excited by the forest's latest birth, a buck fawn his mother has named Bambi. The animals are more excited than usual as Bambi's lineage means he will inherit the title of prince of the forest. Along with his mother, Bambi navigates through life with the help of his similarly aged friends, Thumper, a rabbit kit who needs to be continually reminded by his mother of all the lessons his father has taught him about how to live as a rabbit properly, and Flower, a skunk kit who likes his name. As different animals, they have their own issues and challenges which may not translate to the others. Being similarly aged, Bambi, Thumper and Flower may have to experience the uncharted phases of their lives without the knowledge or wisdom unless gleaned from those who have gone through them before. Bambi has to learn early that the lives of deer and of many of the other forest animals are not without their inherent dangers, for deer especially in the beautiful albeit exposed meadow. Bambi will also find that his ascension to prince of the forest is not a guarantee as other buck deer and situations may threaten that ascension.", "rottenTomatoes": "91%", "imdbRating": "7.3", "Metascore": "91", "BoxOffice": "$102,247,150", "imdbVotes": "144,173", "criticConsensus": "Elegantly animated and deeply touching, Bambi is an enduring, endearing, and moving Disney classic.", "Rank": "54", "Poster": "https://m.media-amazon.com/images/M/MV5BY2JhMTJmYjYtNTVkYi00OWE3LWJlMjEtOWI4MTFkMjJhMmQ3XkEyXkFqcGdeQXVyNzY1NDgwNjQ@._V1_SX300.jpg"}, {"Title": "Tarzan", "Year": "1999", "Rated": "G", "Runtime": "88", "Genre": "Animation, Adventure, Comedy", "Director": "Chris Buck, Kevin Lima", "Plot": "The movie is about the life of Tarzan. Tarzan was a small orphan who was raised by an ape named Kala since he was a child. He believed that this was his family, but on an expedition Jane Porter is rescued by Tarzan. He then finds out that he's human. Now Tarzan must make the decision as to which family he should belong to...", "rottenTomatoes": "89%", "imdbRating": "7.3", "Metascore": "79", "BoxOffice": "$171,091,819", "imdbVotes": "227,850", "criticConsensus": "Disney's Tarzan takes the well-known story to a new level with spirited animation, a brisk pace, and some thrilling action set-pieces..", "Rank": "66", "Poster": "https://m.media-amazon.com/images/M/MV5BY2ZiYWUxN2ItYmQxZi00NDlkLWE2NDAtOTNmYTg1MDI0NDk1XkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_SX300.jpg"}, {"Title": "Sleeping Beauty", "Year": "1959", "Rated": "G", "Runtime": "75", "Genre": "Animation, Adventure, Family", "Director": "Clyde Geronimi", "Plot": "After the beautiful Princess Aurora is born into royalty, everyone gathers to celebrate. Everything is perfectly fine until an unwanted guest appears, the evil fairy Maleficent. Maleficent curses the young princess and announces that she will die by pricking her finger on the spindle of a spinning wheel before sunset on her 16th birthday. Fortunately, one of the good fairies, Merryweather, changes the spell so Aurora will fall into a deep sleep instead, and the only way to wake her from her sleep is true love's kiss. Finally the day comes.", "rottenTomatoes": "89%", "imdbRating": "7.2", "Metascore": "85", "BoxOffice": "$51,600,000", "imdbVotes": "149,912", "criticConsensus": "This Disney dreamscape contains moments of grandeur, with its lush colors, magical air, one of the most menacing villains in the Disney canon.", "Rank": "68", "Poster": "https://m.media-amazon.com/images/M/MV5BOTJmZjA3MjMtMWNmZS00YTliLWFhMWUtZDU2NGJhNTlmY2ZkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg"}, {"Title": "Millions", "Year": "2004", "Rated": "PG", "Runtime": "98", "Genre": "Comedy, Crime, Drama", "Director": "Danny Boyle", "Plot": "The UK is about to switch its currency from Pounds to Euros, giving a gang a chance to rob the poorly-secured train loaded with money on its way to incineration. But, during the robbery, one of the big bags falls literally from the sky on Damian's playhouse, a 7-year old given to talking to saints. The boy then starts seeing what the world and the people around him are made of. Ethics, being human and the soul all come to the forefront in this film.", "rottenTomatoes": "88%", "imdbRating": "6.8", "Metascore": "74", "BoxOffice": "$6,584,159", "imdbVotes": "25,681", "criticConsensus": "A charming children fable even adults can enjoy.", "Rank": "71", "Poster": "https://m.media-amazon.com/images/M/MV5BNTI3Y2RjOTMtNmM0OC00OGI4LTgxOGQtMjFhZTVjODdkNWEwXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SX300.jpg"}, {"Title": "Freaky Friday", "Year": "2003", "Rated": "PG", "Runtime": "97", "Genre": "Comedy, Family, Fantasy", "Director": "Mark Waters", "Plot": "The wide generation gap between Tess Coleman and her teenage daughter Anna is more than evident. They simply cannot understand each other's preferences. On a Thursday night they have a big argument in a Chinese restaurant. Both receive a fortune cookie each from the restaurant owner's mother which causes them to switch bodies next day. As they adjust with their new personalities, they begin to understand each other more and eventually it's the mutual self-respect that sorts the things out.", "rottenTomatoes": "88%", "imdbRating": "6.3", "Metascore": "70", "BoxOffice": "$110,230,332", "imdbVotes": "140,517", "criticConsensus": "Jamie Lee Curtis and Lindsay Lohan charm in Mark Waters' nicely pitched -- and Disney's second -- remake of the 1976 hit.", "Rank": "72", "Poster": "https://m.media-amazon.com/images/M/MV5BYmU4NTk4OWYtMjE4My00MGVkLTgwY2EtZTZjN2YyOGFiMDQ0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg"}, {"Title": "The Muppet Movie", "Year": "1979", "Rated": "G", "Runtime": "95", "Genre": "Adventure, Comedy, Family", "Director": "James Frawley", "Plot": "While living the quiet life in a swamp, Kermit the Frog is approached by a Hollywood agent to audition for the chance of a lifetime. So Kermit takes this chance for his big break as he makes the journey to Hollywood. Along the way, Kermit comes across several quirky new friends including comedic Fozzie Bear, beautiful but feisty Miss Piggy, and the Great Gonzo. But Kermit must also watch out for ruthless Doc Hopper, who plans to use him as his spokesman for his frog legs food chain.", "rottenTomatoes": "88%", "imdbRating": "7.6", "Metascore": "74", "BoxOffice": "$65,810,475", "imdbVotes": "36,629", "criticConsensus": "The Muppet Movie, the big-screen debut of Jim Henson's plush creations, is smart, lighthearted, and fun for all ages.", "Rank": "73", "Poster": "https://m.media-amazon.com/images/M/MV5BMGQ0OGM5YjItYzYyMi00NmVmLWI3ODMtMTY2NGRkZmI5MWU2XkEyXkFqcGdeQXVyMzI0NDc4ODY@._V1_SX300.jpg"}, {"Title": "Lilo & Stitch", "Year": "2002", "Rated": "PG", "Runtime": "85", "Genre": "Animation, Adventure, Comedy", "Director": "Dean DeBlois, Chris Sanders", "Plot": "In a place far, far away, illegal genetic experiment #626 is detected: Ruthless scientist Dr. Jumba Jookiba has created a strong, intelligent, nearly indestructible and aggressive being with only one known weakness: The high density of his body makes it impossible for the experiment to swim in water. The scientist is sentenced to jail by the Grand Council of the Galactic Federation. The experiment is supposed to be transported to a prison asteroid, yet manages to escape Captain Gantu, who was supposed to deliver him there. With a stolen police cruiser (the red one), the destructive being races towards a little and already doomed planet: Earth. Stranded on Hawaii, experiment #626 can't actually do much harm: water all around, no big cities and two well-equipped representatives of the Galactic Federation already following close behind to catch him again. But Dr. Jookiba and the Earth expert Pleakley never could have guessed that earth girl Lilo adopts the experiment as dog, gives him the name Stitch and actually causes an emotional development in the little beast. Her dysfunctional family, consisting only of Lilo and her sister Nani, is about to be ripped apart by social worker Cobra Bubbles. Stitch as the new family member brings quite some action into all their lifes, and after a while, not even Pleakley and Dr. Jookiba can recognize their former target. But how shall they bring the news of failure to the Grand Councilwoman without being punished?", "rottenTomatoes": "87%", "imdbRating": "7.3", "Metascore": "73", "BoxOffice": "$145,794,338", "imdbVotes": "192,221", "criticConsensus": "Edgier than traditional Disney fare, Lilo and Stitch explores issues of family while providing a fun and charming story.", "Rank": "76", "Poster": "https://m.media-amazon.com/images/M/MV5BMTkwOTU5MTA2M15BMl5BanBnXkFtZTYwMjYyNTc3._V1_SX300.jpg"}, {"Title": "The Emperor's New Groove", "Year": "2000", "Rated": "G", "Runtime": "78", "Genre": "Animation, Adventure, Comedy", "Director": "Mark Dindal", "Plot": "In this animated comedy from the folks at Disney, the vain and cocky Emperor Kuzco (David Spade) is a very busy man. Besides maintaining his \"groove\", and firing his suspicious administrator, Yzma (Eartha Kitt), he's also planning to build a new waterpark just for himself for his birthday. However, this means destroying one of the villages in his kingdom. Meanwhile, Yzma is hatching a plan to get revenge and usurp the throne. But, in a botched assassination courtesy of Yzma's right-hand man, Kronk (Patrick Warburton), Kuzco is magically transformed into a llama. Now, Kuzco finds himself the property of Pacha, a lowly llama herder whose home is ground zero for the water park. Upon discovering the llama's true self, Pacha offers to help resolve the Emperor's problem and regain his throne, only if he promises to move his water park.", "rottenTomatoes": "86%", "imdbRating": "7.4", "Metascore": "70", "BoxOffice": "$89,636,687", "imdbVotes": "205,556", "criticConsensus": "The Emperor's New Groove isn't the most ambitious animated film, but its brisk pace, fresh characters, and big laughs make for a great time for the whole family.", "Rank": "78", "Poster": "https://m.media-amazon.com/images/M/MV5BZGQwNmFhNjctNzQ0Yy00ZmE5LWIyMTEtYTZhZWQ4OTFmNDI2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTMxMjgxMzA@._V1_SX300.jpg"}, {"Title": "Mulan", "Year": "1998", "Rated": "G", "Runtime": "88", "Genre": "Animation, Adventure, Comedy", "Director": "Barry Cook, Tony Bancroft", "Plot": "This retelling of the old Chinese folktale is about the story of a young Chinese maiden who learns that her weakened and lame father is to be called up into the army in order to fight the invading Huns. Knowing that he would never survive the rigours of war in his state, she decides to disguise herself and join in his place. Unknown to her, her ancestors are aware of this and to prevent it, they order a tiny disgraced dragon, Mushu to join her in order to force her to abandon her plan. He agrees, but when he meets Mulan, he learns that she cannot be dissuaded and so decides to help her in the perilous times ahead.", "rottenTomatoes": "85%", "imdbRating": "7.6", "Metascore": "71", "BoxOffice": "$120,620,254", "imdbVotes": "289,126", "criticConsensus": "Exploring themes of family duty and honor, Mulan breaks new ground as a Disney film, while still bringing vibrant animation and sprightly characters to the screen.", "Rank": "79", "Poster": "https://m.media-amazon.com/images/M/MV5BODkxNGQ1NWYtNzg0Ny00Yjg3LThmZTItMjE2YjhmZTQ0ODY5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg"}, {"Title": "Anastasia", "Year": "1997", "Rated": "G", "Runtime": "94", "Genre": "Animation, Adventure, Drama", "Director": "Don Bluth, Gary Goldman", "Plot": "The daughter of the last Russian Czar, Nicolas II (Rick Jones), Anastasia (Meg Ryan) is found by two Russian con men, Dimitri (John Cusack) and Vladimir (Kelsey Grammer), who seek the reward that her grandmother, the Dowager Empress Marie Feodorovna (Dame Angela Lansbury), promised to the ones who'll find her. But the evil mystic of the Czar family, Grigori Rasputin (Christopher Lloyd), still wants the Romanov family to be destroyed forever.", "rottenTomatoes": "86%", "imdbRating": "7.1", "Metascore": "61", "BoxOffice": "$58,406,347", "imdbVotes": "125,013", "criticConsensus": "Beautiful animation, an affable take on Russian history, and strong voice performances make Anastasia a winning first film from Fox animation studios.", "Rank": "80", "Poster": "https://m.media-amazon.com/images/M/MV5BNGJiNWFlYTMtZTBiZi00ZTVmLWJmZmMtNzEzYzZjNzYzZmRmXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_SX300.jpg"}, {"Title": "Hercules", "Year": "1997", "Rated": "G", "Runtime": "93", "Genre": "Animation, Adventure, Comedy", "Director": "Ron Clements, John Musker", "Plot": "Hercules, son of the Greek God, Zeus, is turned into a half-god, half-mortal by evil Hades, God of the Underworld, who plans to overthrow Zeus. Hercules is raised on Earth and retains his god-like strength, but when he discovers his immortal heritage Zeus tells him that to return to Mount Olympus he must become a true hero. Hercules becomes a famous hero with the help of his friend Pegasus and his personal trainer, Phil the satyr. Hercules battles monsters, Hades and the Titans, but it is his self-sacrifice to rescue his love Meg which makes him a true hero.", "rottenTomatoes": "84%", "imdbRating": "7.3", "Metascore": "74", "BoxOffice": "$99,112,101", "imdbVotes": "232,821", "criticConsensus": "Fast-paced and packed with dozens of pop culture references, Hercules might not measure up with the true classics of the Disney pantheon, but it's still plenty of fun.", "Rank": "86", "Poster": "https://m.media-amazon.com/images/M/MV5BZDcwYjEyNWItMGI1Mi00MjI1LWIyMDEtMTQ4YjhkNjM4NDU3XkEyXkFqcGdeQXVyNDUyOTg3Njg@._V1_SX300.jpg"}, {"Title": "Fantasia 2000", "Year": "1999", "Rated": "G", "Runtime": "75", "Genre": "Animation, Family, Fantasy", "Director": "James Algar, Gaëtan Brizzi, Paul Brizzi, Hendel Butoy", "Plot": "In this update of Disney's masterpiece film mixture of animation and music, new interpretations of great works of music are presented. It begins with an abstract battle of light and darkness set to the music of Beethoveen's Fifth Symphony. Then we see the adventures of a humpback whale calf and his pod set to \"The Pines of Rome.\" Next is the humorous story of several lives in 1930's New York City, scored with \"Rhapsody in Blue.\" Following is a musical telling of the fairy tale, \"The Steadfast Tin Soldier\" set to Dmitri Shostakovich's Piano Concerto No. 2. Then a goofy flamingo causes havoc in his flock with his yo-yo to the tune of the finale of \"Carnival of the Animals.\" This is followed by the classic sequence from the original film, \"The Sorcerer's Apprentice\" starring Mickey Mouse and followed by \"Pomp and Circumstance\" starring Donald Duck as a harried assistant to Noah on his Ark. Finally, we see the awesome tale of the life, death, and renewal of a forest in a sequence featuring the composition, \"The Firebird.\"", "rottenTomatoes": "81%", "imdbRating": "7.1", "Metascore": "59", "BoxOffice": "$60,655,420", "imdbVotes": "38,972", "criticConsensus": "It provides an entertaining experience for adults and children alike.", "Rank": "94", "Poster": "https://m.media-amazon.com/images/M/MV5BMTE3OGUxNmItZmM3MC00ZTI3LTg0YTUtMzA3MGJkZjkyNjEyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg"}], null, null], [[{"Title": "Inside Out", "Year": "2015", "Rated": "PG", "Runtime": "95", "Genre": "Animation, Adventure, Comedy", "Director": "Pete Docter", "Plot": "Growing up can be a bumpy road, and it's no exception for Riley, who is uprooted from her Midwest life when her father starts a new job in San Francisco. Like all of us, Riley is guided by her emotions - Joy, Fear, Anger, Disgust and Sadness. The emotions live in Headquarters, the control center inside Riley's mind, where they help advise her through everyday life. As Riley and her emotions struggle to adjust to a new life in San Francisco, turmoil ensues in Headquarters. Although Joy, Riley's main and most important emotion, tries to keep things positive, the emotions conflict on how best to navigate a new city, house and school.", "rottenTomatoes": "98%", "imdbRating": "8.2", "Metascore": "94", "BoxOffice": "$356,921,711", "imdbVotes": "711,574", "criticConsensus": "Inventive, gorgeously animated, and powerfully moving, Inside Out is another outstanding addition to the Pixar library of modern animated classics.", "Rank": "5", "Poster": "https://m.media-amazon.com/images/M/MV5BOTgxMDQwMDk0OF5BMl5BanBnXkFtZTgwNjU5OTg2NDE@._V1_SX300.jpg"}, {"Title": "WALL·E", "Year": "2008", "Rated": "G", "Runtime": "98", "Genre": "Animation, Adventure, Family", "Director": "Andrew Stanton", "Plot": "In a distant, but not so unrealistic, future where mankind has abandoned earth because it has become covered with trash from products sold by the powerful multi-national Buy N Large corporation, WALL-E, a garbage collecting robot has been left to clean up the mess. Mesmerized with trinkets of Earth's history and show tunes, WALL-E is alone on Earth except for a sprightly pet cockroach. One day, EVE, a sleek (and dangerous) reconnaissance robot, is sent to Earth to find proof that life is once again sustainable. WALL-E falls in love with EVE. WALL-E rescues EVE from a dust storm and shows her a living plant he found amongst the rubble. Consistent with her \"directive\", EVE takes the plant and automatically enters a deactivated state except for a blinking green beacon. WALL-E, doesn't understand what has happened to his new friend, but, true to his love, he protects her from wind, rain, and lightning, even as she is unresponsive. One day a massive ship comes to reclaim EVE, but WALL-E, out of love or loneliness, hitches a ride on the outside of the ship to rescue EVE. The ship arrives back at a large space cruise ship, which is carrying all of the humans who evacuated Earth 700 years earlier. The people of Earth ride around this space resort on hovering chairs which give them a constant feed of TV and video chatting. They drink all of their meals through a straw out of laziness and/or bone loss, and are all so fat that they can barely move. When the auto-pilot computer, acting on hastily-given instructions sent many centuries before, tries to prevent the people of Earth from returning by stealing the plant, WALL-E, EVE, the portly captain, and a band of broken robots stage a mutiny.", "rottenTomatoes": "95%", "imdbRating": "8.4", "Metascore": "95", "BoxOffice": "$223,808,164", "imdbVotes": "1,112,363", "criticConsensus": "Wall-E's stellar visuals testify once again to Pixar's ingenuity, while its charming star will captivate younger viewers -- and its timely story offers thought-provoking subtext.", "Rank": "25", "Poster": "https://m.media-amazon.com/images/M/MV5BMjExMTg5OTU0NF5BMl5BanBnXkFtZTcwMjMxMzMzMw@@._V1_SX300.jpg"}, {"Title": "Finding Dory", "Year": "2016", "Rated": "PG", "Runtime": "97", "Genre": "Animation, Adventure, Comedy", "Director": "Andrew Stanton", "Plot": "Dory is a wide-eyed, blue tang fish who suffers from memory loss every 10 seconds or so. The one thing she can remember is that she somehow became separated from her parents as a child. With help from her friends Nemo and Marlin, Dory embarks on an epic adventure to find them. Her journey brings her to the Marine Life Institute, a conservatory that houses diverse ocean species.", "rottenTomatoes": "94%", "imdbRating": "7.3", "Metascore": "77", "BoxOffice": "$486,295,561", "imdbVotes": "277,134", "criticConsensus": "Funny, poignant, and thought-provoking, Finding Dory delivers a beautifully animated adventure that adds another entertaining chapter to its predecessor's classic story.", "Rank": "32", "Poster": "https://m.media-amazon.com/images/M/MV5BNzg4MjM2NDQ4MV5BMl5BanBnXkFtZTgwMzk3MTgyODE@._V1_SX300.jpg"}, {"Title": "Fantastic Mr. Fox", "Year": "2009", "Rated": "PG", "Runtime": "87", "Genre": "Animation, Adventure, Comedy", "Director": "Wes Anderson", "Plot": "This is the story of Mr. Fox (George Clooney) and his wild ways of hen heckling, turkey taking, and cider sipping, nocturnal, instinctive adventures. He has to put his wild days behind him and do what fathers do best: be responsible. He is too rebellious. He is too wild. He is going to try \"just one more raid\" on the three nastiest, meanest farmers that are Walter Boggis (Robin Hurlstone), Nathan Bunce (Hugo Guinness), and Franklin Bean (Sir Michael Gambon). It is a tale of crossing the line of family responsibilities and midnight adventure and the friendships and awakenings of this country life that is inhabited by Fantastic Mr. Fox and his friends.", "rottenTomatoes": "93%", "imdbRating": "7.9", "Metascore": "83", "BoxOffice": "$21,002,919", "imdbVotes": "233,260", "criticConsensus": "Fantastic Mr. Fox is a delightfully funny feast for the eyes with multi-generational appeal -- and it shows Wes Anderson has a knack for animation.", "Rank": "40", "Poster": "https://m.media-amazon.com/images/M/MV5BOGUwYTU4NGEtNDM4MS00NDRjLTkwNmQtOTkwMWMyMjhmMjdlXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SX300.jpg"}, {"Title": "Winnie the Pooh", "Year": "2011", "Rated": "G", "Runtime": "63", "Genre": "Animation, Adventure, Comedy", "Director": "Stephen J. Anderson, Don Hall", "Plot": "During an ordinary day in Hundred Acre Wood, Winnie the Pooh sets out to find some honey. Misinterpreting a note from Christopher Robin, Owl convinces Tigger, Rabbit, Piglet, Pooh, Kanga, Roo, and Eeyore that their young friend has been captured by a creature named the Backson, and they set out to save him.", "rottenTomatoes": "90%", "imdbRating": "7.1", "Metascore": "74", "BoxOffice": "$26,692,846", "imdbVotes": "25,707", "criticConsensus": "Short, nostalgic, and gently whimsical, Winnie the Pooh offers young audiences -- and their parents -- a sweetly traditional family treat.", "Rank": "61", "Poster": "https://m.media-amazon.com/images/M/MV5BYzBlYTJkMGQtYzQ4MS00Zjk3LTk4MmEtYTZiNTEzNmRlMjUxXkEyXkFqcGdeQXVyMzI0NDc4ODY@._V1_SX300.jpg"}, {"Title": "Bolt", "Year": "2008", "Rated": "PG", "Runtime": "96", "Genre": "Animation, Adventure, Comedy", "Director": "Chris Williams, Byron Howard", "Plot": "Bolt, an American white shepherd, has lived his whole life on the set of his action TV show, where he believes he has superpowers. When separated from the studio by accident, he meets a female alley cat named Mittens and a hamster named Rhino. He's trying to find the way home, to the studio. Along the way, he learns that he doesn't have superpowers and that the show is not real.", "rottenTomatoes": "89%", "imdbRating": "6.8", "Metascore": "67", "BoxOffice": "$114,053,579", "imdbVotes": "212,505", "criticConsensus": "Bolt is a pleasant animated comedy that overcomes the story's familiarity with strong visuals and likable characters.", "Rank": "65", "Poster": "https://m.media-amazon.com/images/M/MV5BNDQyNDE5NjQ1N15BMl5BanBnXkFtZTcwMDExMTAwMg@@._V1_SX300.jpg"}, {"Title": "The Peanuts Movie", "Year": "2015", "Rated": "G", "Runtime": "88", "Genre": "Animation, Adventure, Comedy", "Director": "Steve Martino", "Plot": "Charlie Brown, Snoopy, and the whole gang are back in a heartwarming story. A new girl with red hair moves in across the street, and Charlie Brown falls in love. Now he tries to impress the Little Red-Haired Girl to make her feel like he's a winner, but Charlie Brown just can't do anything right. At the same time, Snoopy is writing a love story about his continuing battles with The Red Baron. Then Charlie Brown has accomplished something never done before. He gets a perfect score on his standardized test, but there has been a mistake. Should he tell the truth and risk losing all of his newfound popularity? Can Charlie Brown get the girl to love him, or will he go back to being a nothing?", "rottenTomatoes": "87%", "imdbRating": "7.0", "Metascore": "67", "BoxOffice": "$130,178,411", "imdbVotes": "46,636", "criticConsensus": "The Peanuts Movie offers a colorful gateway into the world of its classic characters and a sweetly nostalgic -- if relatively unambitious -- treat for the adults who grew up with them.", "Rank": "75", "Poster": "https://m.media-amazon.com/images/M/MV5BNTE5NzMxNzkwNl5BMl5BanBnXkFtZTgwOTQ0Nzk5NzE@._V1_SX300.jpg"}, {"Title": "The Princess and the Frog", "Year": "2009", "Rated": "G", "Runtime": "97", "Genre": "Animation, Adventure, Comedy", "Director": "Ron Clements, John Musker", "Plot": "A modern day retelling of the classic story The Frog Prince. The Princess and the Frog finds the lives of arrogant, carefree Prince Naveen and hardworking waitress Tiana crossing paths. Prince Naveen is transformed into a frog by a conniving voodoo magician and Tiana, following suit, upon kissing the amphibian royalty. With the help of a trumpet-playing alligator, a Cajun firefly, and an old blind lady who lives in a boat in a tree, Naveen and Tiana must race to break the spell and fulfill their dreams.", "rottenTomatoes": "85%", "imdbRating": "7.1", "Metascore": "73", "BoxOffice": "$104,400,899", "imdbVotes": "146,765", "criticConsensus": "The warmth of traditional Disney animation makes this occasionally lightweight fairy-tale update a lively and captivating confection for the holidays.", "Rank": "83", "Poster": "https://m.media-amazon.com/images/M/MV5BMjEyOTQ5NzAzNl5BMl5BanBnXkFtZTcwMTcyNTU1Mg@@._V1_SX300.jpg"}, {"Title": "The Book of Life", "Year": "2014", "Rated": "PG", "Runtime": "95", "Genre": "Animation, Adventure, Comedy", "Director": "Jorge R. Gutierrez", "Plot": "From producer Guillermo del Toro and director Jorge Gutierrez comes an animated comedy with a unique visual style. THE BOOK OF LIFE is the journey of Manolo, a young man who is torn between fulfilling the expectations of his family and following his heart. Before choosing which path to follow, he embarks on an incredible adventure that spans three fantastical worlds where he must face his greatest fears. Rich with a fresh take on pop music favorites, THE BOOK OF LIFE encourages us to celebrate the past while looking forward to the future.", "rottenTomatoes": "83%", "imdbRating": "7.2", "Metascore": "67", "BoxOffice": "$50,151,543", "imdbVotes": "72,371", "criticConsensus": "The Book of Life's gorgeous animation is a treat, but it's a pity that its story lacks the same level of craft and detail that its thrilling visuals provide.", "Rank": "88", "Poster": "https://m.media-amazon.com/images/M/MV5BMTkzOTgzNDYzOF5BMl5BanBnXkFtZTgwOTgxMTkyMjE@._V1_SX300.jpg"}, {"Title": "Chip 'n Dale: Rescue Rangers", "Year": "2022", "Rated": "PG", "Runtime": "97", "Genre": "Animation, Adventure, Comedy", "Director": "Akiva Schaffer", "Plot": "Thirty years after their popular television show ended, chipmunks Chip and Dale live very different lives. When a cast member from the original series mysteriously disappears, the pair must reunite to save their friend.", "rottenTomatoes": "66/100", "imdbRating": "7.0", "Metascore": "66", "BoxOffice": "N/A", "imdbVotes": "39,807", "criticConsensus": "Sometimes some reboots fall through the cracks, but Chip 'n' Dale", "Rank": "100", "Poster": "https://m.media-amazon.com/images/M/MV5BZjBlMjIxN2ItNTMyNi00NDk5LWFhMzEtNzdiODE0Y2M4MWI2XkEyXkFqcGdeQXVyMTM1MTE1NDMx._V1_SX300.jpg"}], null, null]]], ["Do you want to watch something over 100 min (yes/no)?", ["Do you want to watch a movie that is over 15 years old (yes/no)?", [[{"Title": "West Side Story", "Year": "1961", "Rated": "Approved", "Runtime": "153", "Genre": "Crime, Drama, Musical", "Director": "Steven Spielberg", "Plot": "West Side Story is the award-winning adaptation of the classic romantic tragedy \"Romeo and Juliet\". The feuding families become two warring New York City gangs--the white Jets led by Riff and the Latino Sharks, led by Bernardo. Their hatred escalates to a point where neither can coexist with any form of understanding. But when Riff's best friend (and former Jet) Tony and Bernardo's younger sister Maria meet at a dance, no one can do anything to stop their love. Maria and Tony begin meeting in secret, planning to run away. Then the Sharks and Jets plan a rumble under the highway--whoever wins gains control of the streets. Maria sends Tony to stop it, hoping it can end the violence. It goes terribly wrong, and before the lovers know what's happened, tragedy strikes and doesn't stop until the climactic and heartbreaking ending.", "rottenTomatoes": "92%", "imdbRating": "7.6", "Metascore": "86", "BoxOffice": "$44,055,492", "imdbVotes": "114,760", "criticConsensus": "Steven Spielberg's West Side Story presents a new look at the classic musical that lives up to its beloved forebear -- and in some respects might even surpass it.", "Rank": "49", "Poster": "https://m.media-amazon.com/images/M/MV5BMTM0NDAxOTI5MF5BMl5BanBnXkFtZTcwNjI4Mjg3NA@@._V1_SX300.jpg"}, {"Title": "Ever After: A Cinderella Story", "Year": "1998", "Rated": "PG-13", "Runtime": "121", "Genre": "Comedy, Drama, Romance", "Director": "Andy Tennant", "Plot": "Andy Tennant directed this Cinderella variant. The Brothers Grimm arrive at the home of a wealthy Grande Dame (Jeanne Moreau) who speaks of the many legends surrounding the fable of the cinder girl before telling the \"true\" story of her ancestor. In flashback, the story then focuses on eight-year-old Danielle, daughter of a wealthy widower, a 16th-century landowner. After returning to France with his new wife Rodmilla (Anjelica Huston) and her two daughters, he dies of a heart attack. Ten years later, Danielle (Drew Barrymore) is now treated as a servant by the trio. Fortunately, she has an encounter with Prince Henry (Dougray Scott), who is fleeing an arranged marriage. Later, when Danielle poses as a Lady, the Prince takes an interest in her. Inventor-artist Leonardo Da Vinci (Patrick Godfrey), accepting the French court's patronage, offers advice to Prince Henry on matters of the heart.", "rottenTomatoes": "91%", "imdbRating": "7.1", "Metascore": "66", "BoxOffice": "$65,705,771", "imdbVotes": "76,482", "criticConsensus": "Ever After is a sweet, frothy twist on the ancient fable, led by a solid turn from star Barrymore.", "Rank": "53", "Poster": "https://m.media-amazon.com/images/M/MV5BN2FhYTY5ODItOGU4OC00MTkyLTlmYTMtYjIxN2Y4MmVlMDVhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg"}, {"Title": "Edward Scissorhands", "Year": "1990", "Rated": "PG-13", "Runtime": "105", "Genre": "Drama, Fantasy, Romance", "Director": "Tim Burton", "Plot": "In a castle high on top of a hill lives an inventor's greatest creation - Edward, a near-complete person. The creator died before he could finish Edward's hands; instead, he is left with metal scissors for hands. Since then, he has lived alone, until a kind lady called Peg discovers him and welcomes him into her home. At first, everyone welcomes him into the community, but soon things begin to take a change for the worse.", "rottenTomatoes": "89%", "imdbRating": "7.9", "Metascore": "74", "BoxOffice": "$56,362,352", "imdbVotes": "491,967", "criticConsensus": "The first collaboration between Johnny Depp and Tim Burton, Edward Scissorhands is a magical modern fairy tale with gothic overtones and a sweet center.", "Rank": "67", "Poster": "https://m.media-amazon.com/images/M/MV5BMWY2MGRkNjgtZDczNi00YWJjLTkwNmUtMTY0NTE5ZDhkZjgwXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_SX300.jpg"}, {"Title": "X2: X-Men United", "Year": "2003", "Rated": "PG-13", "Runtime": "134", "Genre": "Action, Adventure, Sci-Fi", "Director": "Bryan Singer", "Plot": "Several months have passed since the X-Men defeated Magneto and imprisoned him in a seemingly impregnable plastic chamber. One day, a mutant by the name of Nightcrawler infiltrates the White House and attempts to assassinate the President, setting off a chain reaction of anti-mutant measures by the government. Meanwhile, Logan is trying to discover his past. As scientist named William Stryker discovers Professor X's secret school and Cerebro, Magneto's partner, Mystique, is planning to break her leader out of prison. But when Professor X's school is attacked by Stryker's forces, Logan, Rogue, Iceman, and a few are lucky to escape. Those who remain meet in Boston, where they form an uneasy alliance with Magneto to stop Stryker and rescue Professor X.", "rottenTomatoes": "85%", "imdbRating": "7.4", "Metascore": "68", "BoxOffice": "$214,949,694", "imdbVotes": "551,598", "criticConsensus": "Tightly scripted, solidly acted, and impressively ambitious, X2", "Rank": "82", "Poster": "https://m.media-amazon.com/images/M/MV5BNDk0NjYxMzIzOF5BMl5BanBnXkFtZTYwMTc1MjU3._V1_SX300.jpg"}, {"Title": "Drumline", "Year": "2002", "Rated": "PG-13", "Runtime": "118", "Genre": "Comedy, Drama, Romance", "Director": "Charles Stone", "Plot": "A fish-out-of-water comedy about a talented street drummer from Harlem who enrolls in a Southern university, expecting to lead its marching band's drumline to victory. He initially flounders in his new world, before realizing that it takes more than talent to reach the top.", "rottenTomatoes": "82%", "imdbRating": "5.9", "Metascore": "63", "BoxOffice": "$56,399,184", "imdbVotes": "34,976", "criticConsensus": "Essentially a sports movie with drums, the energetic Drumline somehow manages to make the familiar seem fresh.", "Rank": "92", "Poster": "https://m.media-amazon.com/images/M/MV5BNzhhY2Y3NDktM2JiYi00YmY0LWEzOGQtMDc4Yzk3ZWIxOTVmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg"}, {"Title": "Pirates of the Caribbean: The Curse of the Black Pearl", "Year": "2003", "Rated": "PG-13", "Runtime": "143", "Genre": "Action, Adventure, Fantasy", "Director": "Gore Verbinski", "Plot": "This swash-buckling tale follows the quest of Captain Jack Sparrow, a savvy pirate, and Will Turner, a resourceful blacksmith, as they search for Elizabeth Swann. Elizabeth, the daughter of the governor and the love of Will's life, has been kidnapped by the feared Captain Barbossa. Little do they know, but the fierce and clever Barbossa has been cursed. He, along with his large crew, are under an ancient curse, doomed for eternity to neither live, nor die. That is, unless a blood sacrifice is made.", "rottenTomatoes": "80%", "imdbRating": "8.1", "Metascore": "63", "BoxOffice": "$305,413,918", "imdbVotes": "1,125,052", "criticConsensus": "May leave you exhausted like the theme park ride that inspired it; however, you'll have a good time when it's over.", "Rank": "98", "Poster": "https://m.media-amazon.com/images/M/MV5BNGYyZGM5MGMtYTY2Ni00M2Y1LWIzNjQtYWUzM2VlNGVhMDNhXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SX300.jpg"}], null, null], [[{"Title": "Hamilton", "Year": "2020", "Rated": "PG-13", "Runtime": "160", "Genre": "Biography, Drama, History", "Director": "Thomas Kail", "Plot": "\"Hamilton\" is the story of America then, told by America now. Featuring a score that blends hip-hop, jazz, R&amp;B, and show tunes, \"Hamilton\" has taken the story of American founding father Alexander Hamilton and created a revolutionary moment in theater--a musical that has had a profound impact on culture, politics, and education. Captured at the Richard Rodgers Theater on Broadway in June 2016, the film transports its audience into the world of the Broadway show in a uniquely intimate way.", "rottenTomatoes": "98%", "imdbRating": "8.4", "Metascore": "89", "BoxOffice": "N/A", "imdbVotes": "94,546", "criticConsensus": "Look around, look around at how beautifully Hamilton shines beyond Broadway - and at how marvelously Thomas Kail captures the stage show's infectious energy.", "Rank": "8", "Poster": "https://m.media-amazon.com/images/M/MV5BNjViNWRjYWEtZTI0NC00N2E3LTk0NGQtMjY4NTM3OGNkZjY0XkEyXkFqcGdeQXVyMjUxMTY3ODM@._V1_SX300.jpg"}, {"Title": "Black Panther", "Year": "2018", "Rated": "PG-13", "Runtime": "134", "Genre": "Action, Adventure, Sci-Fi", "Director": "Ryan Coogler", "Plot": "After the events of Captain America: Civil War, Prince T'Challa returns home to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new king. However, T'Challa soon finds that he is challenged for the throne from factions within his own country. When two foes conspire to destroy Wakanda, the hero known as Black Panther must team up with C.I.A. agent Everett K. Ross and members of the Dora Milaje, Wakandan special forces, to prevent Wakanda from being dragged into a world war.", "rottenTomatoes": "96%", "imdbRating": "7.3", "Metascore": "88", "BoxOffice": "$700,426,566", "imdbVotes": "765,953", "criticConsensus": "Black Panther elevates superhero cinema to thrilling new heights while telling one of the MCU's most absorbing stories -- and introducing some of its most fully realized characters.", "Rank": "18", "Poster": "https://m.media-amazon.com/images/M/MV5BMTg1MTY2MjYzNV5BMl5BanBnXkFtZTgwMTc4NTMwNDI@._V1_SX300.jpg"}, {"Title": "Avengers: Endgame", "Year": "2019", "Rated": "PG-13", "Runtime": "181", "Genre": "Action, Adventure, Drama", "Director": "Anthony Russo, Joe Russo", "Plot": "After the devastating events of Avengers: Infinity War (2018), the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos's actions and undo the chaos to the universe, no matter what consequences may be in store, and no matter who they face...", "rottenTomatoes": "94%", "imdbRating": "8.4", "Metascore": "78", "BoxOffice": "$858,373,000", "imdbVotes": "1,120,634", "criticConsensus": "Exciting, entertaining, and emotionally impactful, Avengers", "Rank": "31", "Poster": "https://m.media-amazon.com/images/M/MV5BMTc5MDE2ODcwNV5BMl5BanBnXkFtZTgwMzI2NzQ2NzM@._V1_SX300.jpg"}, {"Title": "Iron Man", "Year": "2008", "Rated": "PG-13", "Runtime": "126", "Genre": "Action, Adventure, Sci-Fi", "Director": "Jon Favreau", "Plot": "Tony Stark. Genius, billionaire, playboy, philanthropist. Son of legendary inventor and weapons contractor Howard Stark. When Tony Stark is assigned to give a weapons presentation to an Iraqi unit led by Lt. Col. James Rhodes, he's given a ride on enemy lines. That ride ends badly when Stark's Humvee that he's riding in is attacked by enemy combatants. He survives - barely - with a chest full of shrapnel and a car battery attached to his heart. In order to survive he comes up with a way to miniaturize the battery and figures out that the battery can power something else. Thus Iron Man is born. He uses the primitive device to escape from the cave in Iraq. Once back home, he then begins work on perfecting the Iron Man suit. But the man who was put in charge of Stark Industries has plans of his own to take over Tony's technology for other matters.", "rottenTomatoes": "94%", "imdbRating": "7.9", "Metascore": "79", "BoxOffice": "$319,034,126", "imdbVotes": "1,056,101", "criticConsensus": "Powered by Robert Downey Jr.'s vibrant charm, Iron Man turbo-charges the superhero genre with a deft intelligence and infectious sense of fun.", "Rank": "34", "Poster": "https://m.media-amazon.com/images/M/MV5BMTczNTI2ODUwOF5BMl5BanBnXkFtZTcwMTU0NTIzMw@@._V1_SX300.jpg"}, {"Title": "Thor: Ragnarok", "Year": "2017", "Rated": "PG-13", "Runtime": "130", "Genre": "Action, Adventure, Comedy", "Director": "Taika Waititi", "Plot": "Imprisoned on the other side of the universe, the mighty Thor (Chris Hemsworth) finds himself in a deadly gladiatorial contest that puts him against The Incredible Hulk (Mark Ruffalo), his former ally and fellow Avenger. Thor's quest for survival leads him in a race against time to prevent the all-powerful Hela (Cate Blanchett) from destroying his home world and the Asgardian civilization.", "rottenTomatoes": "93%", "imdbRating": "7.9", "Metascore": "74", "BoxOffice": "$315,058,289", "imdbVotes": "749,379", "criticConsensus": "Exciting, funny, and above all fun, Thor", "Rank": "39", "Poster": "https://m.media-amazon.com/images/M/MV5BMjMyNDkzMzI1OF5BMl5BanBnXkFtZTgwODcxODg5MjI@._V1_SX300.jpg"}, {"Title": "Guardians of the Galaxy", "Year": "2014", "Rated": "PG-13", "Runtime": "121", "Genre": "Action, Adventure, Comedy", "Director": "James Gunn", "Plot": "After stealing a mysterious orb in the far reaches of outer space, Peter Quill from Earth is now the main target of a manhunt led by the villain known as Ronan the Accuser. To help fight Ronan and his team and save the galaxy from his power, Quill creates a team of space heroes known as the \"Guardians of the Galaxy\" to save the galaxy.", "rottenTomatoes": "92%", "imdbRating": "8.0", "Metascore": "76", "BoxOffice": "$333,718,600", "imdbVotes": "1,174,356", "criticConsensus": "Guardians of the Galaxy is just as irreverent as fans of the frequently zany Marvel comic would expect -- as well as funny, thrilling, full of heart, and packed with visual splendor.", "Rank": "45", "Poster": "https://m.media-amazon.com/images/M/MV5BZTkwZjU3MTctMGExMi00YjU5LTgwMDMtOWNkZDRlZjQ4NmZhXkEyXkFqcGdeQXVyNjAwNDUxODI@._V1_SX300.jpg"}, {"Title": "The Avengers", "Year": "2012", "Rated": "PG-13", "Runtime": "143", "Genre": "Action, Adventure, Sci-Fi", "Director": "Joss Whedon", "Plot": "Loki, the adopted brother of Thor, teams-up with the Chitauri Army and uses the Tesseract's power to travel from Asgard to Midgard to plot the invasion of Earth and become a king. The director of the agency S.H.I.E.L.D., Nick Fury, sets in motion project Avengers, joining Tony Stark a.k.a. the Iron Man; Steve Rogers, a.k.a. Captain America; Bruce Banner, a.k.a. The Hulk; Thor; Natasha Romanoff, a.k.a. Black Widow; and Clint Barton, a.k.a. Hawkeye, to save the world from the powerful Loki and the alien invasion.", "rottenTomatoes": "91%", "imdbRating": "8.0", "Metascore": "69", "BoxOffice": "$623,357,910", "imdbVotes": "1,387,297", "criticConsensus": "Thanks to a script that emphasizes its heroes' humanity and a wealth of superpowered set pieces, The Avengers lives up to its hype and raises the bar for Marvel at the movies.", "Rank": "50", "Poster": "https://m.media-amazon.com/images/M/MV5BNDYxNjQyMjAtNTdiOS00NGYwLWFmNTAtNThmYjU5ZGI2YTI1XkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SX300.jpg"}, {"Title": "Captain America: Civil War", "Year": "2016", "Rated": "PG-13", "Runtime": "147", "Genre": "Action, Adventure, Sci-Fi", "Director": "Anthony Russo, Joe Russo", "Plot": "With many people fearing the actions of super heroes, the government decides to push for the Hero Registration Act, a law that limits a hero's actions. This results in a division in The Avengers. Iron Man stands with this Act, claiming that their actions must be kept in check otherwise cities will continue to be destroyed, but Captain America feels that saving the world is daring enough and that they cannot rely on the government to protect the world. This escalates into an all-out war between Team Iron Man (Iron Man, Black Panther, Vision, Black Widow, War Machine, and Spider-Man) and Team Captain America (Captain America, Bucky Barnes, Falcon, Scarlet Witch, Hawkeye, and Ant Man) while a new villain emerges.", "rottenTomatoes": "90%", "imdbRating": "7.8", "Metascore": "75", "BoxOffice": "$408,084,349", "imdbVotes": "785,453", "criticConsensus": "Captain America", "Rank": "55", "Poster": "https://m.media-amazon.com/images/M/MV5BMjQ0MTgyNjAxMV5BMl5BanBnXkFtZTgwNjUzMDkyODE@._V1_SX300.jpg"}, {"Title": "Isle of Dogs", "Year": "2018", "Rated": "PG-13", "Runtime": "101", "Genre": "Animation, Adventure, Comedy", "Director": "Wes Anderson", "Plot": "An outbreak of dog flu has spread through the city of Megasaki, Japan, and Mayor Kobayashi has demanded all dogs to be sent to Trash Island. On the island, a young boy named Atari sets out to find his lost dog, Spots, with the help of five other dogs... with many obstacles along the way.", "rottenTomatoes": "90%", "imdbRating": "7.8", "Metascore": "82", "BoxOffice": "$32,015,231", "imdbVotes": "169,724", "criticConsensus": "The beautifully stop-motion animated Isle of Dogs finds Wes Anderson at his detail-oriented best while telling one of the director's most winsomely charming stories.", "Rank": "56", "Poster": "https://m.media-amazon.com/images/M/MV5BZDQwOWQ2NmUtZThjZi00MGM0LTkzNDctMzcyMjcyOGI1OGRkXkEyXkFqcGdeQXVyMTA3MDk2NDg2._V1_SX300.jpg"}, {"Title": "X-Men: Days of Future Past", "Year": "2014", "Rated": "PG-13", "Runtime": "132", "Genre": "Action, Adventure, Sci-Fi", "Director": "Bryan Singer", "Plot": "In the future, the mutants and the humans who help them are slaughtered by powerful robots named Sentinels. Professor Xavier, Wolverine, Magneto, Storm, Kitty Pryde, and her friends meet at a monastery in China and Xavier explains that the invincible Sentinels were created using the DNA of Mystique that was captured in 1973 when she tried to assassinate their creator Dr. Bolivar Trask. Xavier tells that their only chance is return to 1973 using Pryde's ability to join Charles Xavier and Erik Lehnsherr to convince Mystique to give up her intention. However, only Wolverine can withstand the damages of the time travel. Will he succeed in stopping Mystique and the Sentinel Program, and save the mutants and their human friends from annihilation?", "rottenTomatoes": "90%", "imdbRating": "7.9", "Metascore": "75", "BoxOffice": "$233,921,534", "imdbVotes": "712,352", "criticConsensus": "X-Men", "Rank": "57", "Poster": "https://m.media-amazon.com/images/M/MV5BZGIzNWYzN2YtMjcwYS00YjQ3LWI2NjMtOTNiYTUyYjE2MGNkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg"}, {"Title": "Captain America: The Winter Soldier", "Year": "2014", "Rated": "PG-13", "Runtime": "136", "Genre": "Action, Adventure, Sci-Fi", "Director": "Anthony Russo, Joe Russo", "Plot": "For Steve Rogers, awakening after decades of suspended animation involves more than catching up on pop culture; it also means that this old school idealist must face a world of subtler threats and difficult moral complexities. That becomes clear when Director Nick Fury is killed by the mysterious assassin, the Winter Soldier, but not before warning Rogers that SHIELD has been subverted by its enemies. When Rogers acts on Fury's warning to trust no one there, he is branded as a traitor by the organization. Now a fugitive, Captain America must get to the bottom of this deadly mystery with the help of the Black Widow and his new friend, The Falcon. However, the battle will be costly for the Sentinel of Liberty, with Rogers finding enemies where he least expects them while learning that the Winter Soldier looks disturbingly familiar.", "rottenTomatoes": "90%", "imdbRating": "7.8", "Metascore": "70", "BoxOffice": "$259,766,572", "imdbVotes": "843,979", "criticConsensus": "Suspenseful and politically astute, Captain America", "Rank": "58", "Poster": "https://m.media-amazon.com/images/M/MV5BMzA2NDkwODAwM15BMl5BanBnXkFtZTgwODk5MTgzMTE@._V1_SX300.jpg"}, {"Title": "Doctor Strange", "Year": "2016", "Rated": "PG-13", "Runtime": "115", "Genre": "Action, Adventure, Fantasy", "Director": "Scott Derrickson", "Plot": "Marvel's \"Doctor Strange\" follows the story of the talented neurosurgeon Doctor Stephen Strange who, after a tragic car accident, must put ego aside and learn the secrets of a hidden world of mysticism and alternate dimensions. Based in New York City's Greenwich Village, Doctor Strange must act as an intermediary between the real world and what lies beyond, utilising a vast array of metaphysical abilities and artifacts to protect the Marvel Cinematic Universe.", "rottenTomatoes": "89%", "imdbRating": "7.5", "Metascore": "72", "BoxOffice": "$232,641,920", "imdbVotes": "740,558", "criticConsensus": "Doctor Strange artfully balances its outré source material against the blockbuster constraints of the MCU, delivering a thoroughly entertaining superhero origin story in the bargain.", "Rank": "63", "Poster": "https://m.media-amazon.com/images/M/MV5BNjgwNzAzNjk1Nl5BMl5BanBnXkFtZTgwMzQ2NjI1OTE@._V1_SX300.jpg"}, {"Title": "X-Men: First Class", "Year": "2011", "Rated": "PG-13", "Runtime": "131", "Genre": "Action, Adventure, Sci-Fi", "Director": "Matthew Vaughn", "Plot": "Before Charles Xavier and Erik Lensherr took the names Professor X and Magneto, they were two young men discovering their powers for the first time. Before they were archenemies, they were closest of friends, working together, with other Mutants (some familiar, some new), to stop the greatest threat the world has ever known. In the process, a rift between them opened, which began the eternal war between Magneto's Brotherhood and Professor X's X-MEN.", "rottenTomatoes": "86%", "imdbRating": "7.7", "Metascore": "65", "BoxOffice": "$146,408,305", "imdbVotes": "693,778", "criticConsensus": "With a strong script, stylish direction, and powerful performances from its well-rounded cast, X-Men", "Rank": "77", "Poster": "https://m.media-amazon.com/images/M/MV5BMTg5OTMxNzk4Nl5BMl5BanBnXkFtZTcwOTk1MjAwNQ@@._V1_SX300.jpg"}, {"Title": "Guardians of the Galaxy Vol. 2", "Year": "2017", "Rated": "PG-13", "Runtime": "136", "Genre": "Action, Adventure, Comedy", "Director": "James Gunn", "Plot": "After saving Xandar from Ronan's wrath, the Guardians are now recognized as heroes. Now the team must help their leader Star Lord (Chris Pratt) uncover the truth behind his true heritage. Along the way, old foes turn to allies and betrayal is blooming. And the Guardians find that they are up against a devastating new menace who is out to rule the galaxy.", "rottenTomatoes": "85%", "imdbRating": "7.6", "Metascore": "67", "BoxOffice": "$389,813,101", "imdbVotes": "677,802", "criticConsensus": "Guardians of the Galaxy Vol. 2's action-packed plot, dazzling visuals, and irreverent humor add up to a sequel that's almost as fun -- if not quite as thrillingly fresh -- as its predecessor.", "Rank": "81", "Poster": "https://m.media-amazon.com/images/M/MV5BNjM0NTc0NzItM2FlYS00YzEwLWE0YmUtNTA2ZWIzODc2OTgxXkEyXkFqcGdeQXVyNTgwNzIyNzg@._V1_SX300.jpg"}, {"Title": "Rogue One: A Star Wars Story", "Year": "2016", "Rated": "PG-13", "Runtime": "133", "Genre": "Action, Adventure, Sci-Fi", "Director": "Gareth Edwards", "Plot": "All looks lost for the Rebellion against the Empire as they learn of the existence of a new super weapon, the Death Star. Once a possible weakness in its construction is uncovered, the Rebel Alliance must set out on a desperate mission to steal the plans for the Death Star. The future of the entire galaxy now rests upon its success.", "rottenTomatoes": "84%", "imdbRating": "7.8", "Metascore": "65", "BoxOffice": "$533,539,991", "imdbVotes": "635,843", "criticConsensus": "Rogue One draws deep on Star Wars mythology while breaking new narrative and aesthetic ground -- and suggesting a bright blockbuster future for the franchise.", "Rank": "84", "Poster": "https://m.media-amazon.com/images/M/MV5BMjEwMzMxODIzOV5BMl5BanBnXkFtZTgwNzg3OTAzMDI@._V1_SX300.jpg"}, {"Title": "Ant-Man", "Year": "2015", "Rated": "PG-13", "Runtime": "117", "Genre": "Action, Adventure, Comedy", "Director": "Peyton Reed", "Plot": "Armed with the astonishing ability to shrink in scale but increase in strength, con-man Scott Lang must embrace his inner-hero and help his mentor, Dr. Hank Pym, protect the secret behind his spectacular Ant-Man suit from a new generation of towering threats. Against seemingly insurmountable obstacles, Pym and Lang must plan and pull off a heist that will save the world.", "rottenTomatoes": "83%", "imdbRating": "7.3", "Metascore": "64", "BoxOffice": "$180,202,163", "imdbVotes": "665,465", "criticConsensus": "Led by a charming performance from Paul Rudd, Ant-Man offers Marvel thrills on an appropriately smaller scale -- albeit not as smoothly as its most successful predecessors.", "Rank": "87", "Poster": "https://m.media-amazon.com/images/M/MV5BMjM2NTQ5Mzc2M15BMl5BanBnXkFtZTgwNTcxMDI2NTE@._V1_SX300.jpg"}, {"Title": "Avatar", "Year": "2009", "Rated": "PG-13", "Runtime": "162", "Genre": "Action, Adventure, Fantasy", "Director": "James Cameron", "Plot": "When his brother is killed in a robbery, paraplegic Marine Jake Sully decides to take his place in a mission on the distant world of Pandora. There he learns of greedy corporate figurehead Parker Selfridge's intentions of driving off the native humanoid \"Na'vi\" in order to mine for the precious material scattered throughout their rich woodland. In exchange for the spinal surgery that will fix his legs, Jake gathers knowledge, of the Indigenous Race and their Culture, for the cooperating military unit spearheaded by gung-ho Colonel Quaritch, while simultaneously attempting to infiltrate the Na'vi people with the use of an \"avatar\" identity. While Jake begins to bond with the native tribe and quickly falls in love with the beautiful alien Neytiri, the restless Colonel moves forward with his ruthless extermination tactics, forcing the soldier to take a stand - and fight back in an epic battle for the fate of Pandora.", "rottenTomatoes": "82%", "imdbRating": "7.8", "Metascore": "83", "BoxOffice": "$785,221,649", "imdbVotes": "1,247,508", "criticConsensus": "It might be more impressive on a technical level than as a piece of storytelling, but Avatar reaffirms James Cameron's singular gift for imaginative, absorbing filmmaking.", "Rank": "91", "Poster": "https://m.media-amazon.com/images/M/MV5BNjA3NGExZDktNDlhZC00NjYyLTgwNmUtZWUzMDYwMTZjZWUyXkEyXkFqcGdeQXVyMTU1MDM3NDk0._V1_SX300.jpg"}, {"Title": "Free Guy", "Year": "2021", "Rated": "PG-13", "Runtime": "115", "Genre": "Action, Adventure, Comedy", "Director": "Shawn Levy", "Plot": "In the extremely popular video game, Free City, a NPC named Guy learns the true nature of his existence when he meets the girl of his dreams, a human player. This player's interactions with Guy has massive affects on him, the game, and real world as they play it.", "rottenTomatoes": "80%", "imdbRating": "7.1", "Metascore": "62", "BoxOffice": "$121,626,598", "imdbVotes": "366,559", "criticConsensus": "Combining a clever concept, sweet, self-aware humor, and a charming cast, Free Guy is frivolous fun.", "Rank": "97", "Poster": "https://m.media-amazon.com/images/M/MV5BOTY2NzFjODctOWUzMC00MGZhLTlhNjMtM2Y2ODBiNGY1ZWRiXkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_SX300.jpg"}], null, null]], ["Do you want to watch a movie that is over 15 years old (yes/no)?", [[{"Title": "Snow White and the Seven Dwarfs", "Year": "1937", "Rated": "Approved", "Runtime": "83", "Genre": "Animation, Adventure, Family", "Director": "David Hand", "Plot": "The beautiful and kindhearted princess Snow White charms every creature in the kingdom except one - her jealous stepmother, the Queen. When the Magic Mirror proclaims Snow White the fairest one of all, she must flee into the forest, where she befriends the lovable seven dwarfs - Doc, Sneezy, Grumpy, Happy, Bashful, Sleepy, and Dopey. But when the Queen tricks Snow White with a poisoned apple and falling into a deep sleep, only the magic of true love's kiss can awaken her.", "rottenTomatoes": "95/100", "imdbRating": "7.6", "Metascore": "95", "BoxOffice": "$184,925,486", "imdbVotes": "200,347", "criticConsensus": "With its involving story and characters, vibrant art, and memorable songs, Snow White and the Seven Dwarfs set the animation standard for decades to come.", "Rank": "9", "Poster": "https://m.media-amazon.com/images/M/MV5BMTQwMzE2Mzc4M15BMl5BanBnXkFtZTcwMTE4NTc1Nw@@._V1_SX300.jpg"}, {"Title": "Miracle on 34th Street", "Year": "1947", "Rated": "Not Rated", "Runtime": "96", "Genre": "Comedy, Drama, Family", "Director": "George Seaton", "Plot": "At the Macy's Thanksgiving Day Parade, the actor playing Santa is discovered to be drunk by a whiskered old man. Doris Walker, the no nonsense special events director, persuades him to take his place. He proves to be a sensation and is quickly recruited to be the store Santa at the main store. While he is successful, Doris learns that he calls himself Kris Kringle and he claims to be the actual Santa Claus. Despite reassurances by his doctor that he is harmless, Doris still has misgivings, especially when she has cynically trained herself, and especially her daughter, Susan, to reject all notions of belief and fantasy. And yet, people, especially Susan, begin to notice there is something special about Kris and his determination to advance the true spirit of Christmas among the rampant commercialism around him and succeeding in improbable ways. When a raucous conflict with the store's cruelly incompetent therapist, Granville Sawyer, erupts, he finds himself held at Bellevue where, in despair, he deliberately fails a mental examination to ensure his commitment. All seems lost until Doris' friend, Fred Gailey, reassures him of his worth and agrees to represent him in the fight to secure his release. To achieve that, Fred arranges a formal hearing in which he argues that Kris is sane because he is in fact Santa Claus. What ensues is a bizarre hearing in which people's beliefs are reexamined and put to the test, but even so, it's going to take a miracle for Kris to win.", "rottenTomatoes": "96%", "imdbRating": "7.9", "Metascore": "88", "BoxOffice": "N/A", "imdbVotes": "48,433", "criticConsensus": "Irrefutable proof that gentle sentimentalism can be the chief ingredient in a wonderful film, Miracle on 34th Street delivers a warm holiday message without resorting to treacle.", "Rank": "22", "Poster": "https://m.media-amazon.com/images/M/MV5BNjRkOGEwYTUtY2E5Yy00ODg4LTk2ZWItY2IyMzUxOGVhMTM1XkEyXkFqcGdeQXVyNDk0MDg4NDk@._V1_SX300.jpg"}], null, null], [[{"Title": "RiffTrax: Star Wars: The Force Awakens", "Year": "2016", "Rated": "N/A", "Runtime": "60", "Genre": "Comedy", "Director": "J.J. Abrams", "Plot": "Scavenger girl Rey leaves her junkyard home to fulfill her destiny of escorting a robot around the galaxy. Mike Nelson, Bill Corbett, and Kevin Murphy are here to see if there's more to the story in this humorous commentary.", "rottenTomatoes": "N/A", "imdbRating": "2.8", "Metascore": "N/A", "BoxOffice": "N/A", "imdbVotes": "26", "criticConsensus": "Packed with action and populated by both familiar faces and fresh blood, The Force Awakens successfully recalls the series' former glory while injecting it with renewed energy.", "Rank": "38", "Poster": "https://m.media-amazon.com/images/M/MV5BOTI1OTQ3N2YtNmY5YS00OWJkLWIzZGYtNWFiMjlhNTBlMTlmXkEyXkFqcGdeQXVyODk1MTg5MDU@._V1_SX300.jpg"}, {"Title": "The Guardians of the Galaxy Holiday Special", "Year": "2022", "Rated": "TV-14", "Runtime": "41", "Genre": "Action, Adventure, Comedy", "Director": "James Gunn", "Plot": "Watch the Guardians Star-Lord, Gamora, Drax, Rocket, and Groot engage in some spirited shenanigans in an all-new original special created for Disney+.", "rottenTomatoes": "N/A", "imdbRating": "N/A", "Metascore": "N/A", "BoxOffice": "N/A", "imdbVotes": "18,423", "criticConsensus": "More of a stocking stuffer than a fully-rounded parcel, this yuletide excursion is a delightful showcase for Drax, Mantis, and a very game Kevin Bacon.", "Rank": "47", "Poster": "https://m.media-amazon.com/images/M/MV5BOGJjMzlmNzctMWI4Yi00MjcyLWFmYzAtN2JmZjU0YTM4YmRmXkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_SX300.jpg"}, {"Title": "Star Wars: The Last Jedi", "Year": "2008", "Rated": "N/A", "Runtime": "3", "Genre": "Short, Action, Fantasy", "Director": "Rian Johnson", "Plot": "Two kids fight with light sabers around the house.", "rottenTomatoes": "N/A", "imdbRating": "7.3", "Metascore": "N/A", "BoxOffice": "N/A", "imdbVotes": "129", "criticConsensus": "Star Wars", "Rank": "48", "Poster": "https://m.media-amazon.com/images/M/MV5BYTg3N2VkZGEtNjkwYi00ZWVlLWE1YmYtOTZiM2ZiZDY4NTE1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1_SX300.jpg"}, {"Title": "Werewolf by Night", "Year": "2022", "Rated": "TV-14", "Runtime": "52", "Genre": "Action, Adventure, Drama", "Director": "Michael Giacchino", "Plot": "Follows a lycanthrope superhero who fights evil using the abilities given to him by a curse brought on by his bloodline.", "rottenTomatoes": "90%", "imdbRating": "7.2", "Metascore": "N/A", "BoxOffice": "N/A", "imdbVotes": "50,492", "criticConsensus": "A spooky yarn told with taut economy, Werewolf by Night is a standout Marvel entry that proves Michael Giacchino as atmospheric and skilled a director as he is a composer.", "Rank": "62", "Poster": "https://m.media-amazon.com/images/M/MV5BZjI3NjI3NDQtY2RmYS00NTJjLWI0YTQtNTE4NmZiN2UzMWJjXkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_SX300.jpg"}, {"Title": "The Rookie", "Year": "2018", "Rated": "TV-14", "Runtime": "43", "Genre": "Action, Crime, Drama", "Director": "John Lee Hancock", "Plot": "The series follows John Nolan, a 40-year-old man who moves from his comfortable, small-town life to Los Angeles to pursue his dream of being a police officer for the Los Angeles Police Department. He must navigate the dangerous, humorous, and unpredictable world of a \"young\" cop, determined to make his second shot at life count.", "rottenTomatoes": "N/A", "imdbRating": "8.0", "Metascore": "N/A", "BoxOffice": "N/A", "imdbVotes": "40,011", "criticConsensus": "A heart-warming sports flick, The Rookie greatly benefits from understated direction and the emotional honesty Dennis Quaid brings to the role of Jim Morris.", "Rank": "85", "Poster": "https://m.media-amazon.com/images/M/MV5BOTY5OWFmMzAtZTIxYi00NGM4LTk3YWMtY2MyYzMwOWVhZWM0XkEyXkFqcGdeQXVyMzAzNTY3MDM@._V1_SX300.jpg"}], null, null]]]]